{
    "tag": "diabetes_general",
    "patterns": [
      "What can you tell me about a fasting level 126 or greater taken twice is considered a diagnosis of diabetes?",
      "What can you tell me about a keto diet is best for diabetes?",
      "What can you tell me about because the disease is most often diagnosed in children, teens, and young adults, it was formerly called juvenile diabetes?",
      "What can you tell me about but more research is needed, and type 1 diabetes isnt preventable at this time.can you get type 1 diabetes at any age?yes?",
      "What can you tell me about diabetes metab 2016 42 424432?",
      "What can you tell me about there are certain genes called hla markers associated with diabetes risk which can be identified at birth?",
      "What can you tell me about however, a keto diet may not be the best for your heart and kidneys when you have diabetes, and many people are not able to sustain such a limited diet over the long term?",
      "What can you tell me about 11autoantibody testsyour doctor may order a diabetes autoantibody panel to detect autoantibodies that attack insulin or cells in the pancreas related to its production, as well as certain enzymes?",
      "What can you tell me about 9yet 80 percent of people with type 1 diabetes have no family history of the disease?",
      "Can you consult your healthcare professional hcp or rdn for an individualized meal plan ?",
      "What can you tell me about i have not been diagnosed with type 1 or 2 are there any other tests that could help diagnose the type of diabetes i have?a if you were truly type 1, you would require insulin for survival?",
      "What can you tell me about learn all you can at this time on how to manage diabetes and live with it?",
      "What can you tell me about the rela tive importance of physician communication, participatory decision making, and patient understanding indiabetes selfmanagement?",
      "What can you tell me about you may want to discuss this with your physician.q i am new to diabetes and am having trouble sticking myself for testing my blood sugar.a the first step in pricking your finger is to wash your hands with soap and water when at home?",
      "What can you tell me about 5frequently, a bout of dka is what leads to a diagnosis of type 1 diabetes, particularly in young people?",
      "What can you tell me about there is no onesizefitsall diet for people with diabetes?",
      "What can you tell me about for more information, check out the adas guidelines for how different dietary patterns affect diabetes and overall health?",
      "What can you tell me about 29managing type 1 diabetes diet and exercisethere is no onesizefitsall diet or exercise plan for people with type 1 diabetes?",
      "What can you tell me about today, diabetes complications dont need to happen?",
      "What can you tell me about 7other possible risk factors for type 1 diabetes includebeing male?",
      "What can you tell me about national institute of diabetes and digestive and kidney diseases.wortham jm, lee jt, althomsons s, et al?",
      "What can you tell me about by hope warshaw, m.m.sc., rd hope warshaw, m.m.sc., rd hope warshaw is a health educator and corporate consultant specializing in diabetes nutrition?",
      "What can you tell me about 36the agency also reports that at least 187,000 youths under age 20 have type 1 diabetes?",
      "What can you tell me about weigh and balance your decision after some detective work.q what is the best way to test for type 1 diabetes??",
      "What can you tell me about a your risk for hypoglycemia depends on the category of blood glucoselowering medications you take, not your type of diabetes?",
      "What can you tell me about a reading higher than 200 milligrams per deciliter mgdl with symptoms of high blood sugar indicates you have diabetes?",
      "What can you tell me about but type 1 diabetes is an autoimmune disease in which the body attacks and destroys cells that make insulin, while with type 2 diabetes, the body stops using insulin effectively over time.how do you get type 1 diabetes?the cause of type 1 diabetes isnt really known, but experts are looking into a combination of genes and environmental triggers, such as viruses?",
      "What can you tell me about weight regain, aging, and the natural progression of type 2 diabetes can bring it back?",
      "What can you tell me about we know that patients with uncontrolled diabetes and covid19 infection experience more severe symptoms of covid19, can have more extensive lung involvement, and die more often, says thomas?",
      "What can you tell me about glucose doesnt enter the cells as efficiently as before and instead builds up in the bloodstream.in type 2 diabetes, the pancreas responds to these increased blood glucose levels by producing more insulin?",
      "What can you tell me about american diabetes association.will i pass on type 1 diabetes to my baby??",
      "What can you tell me about many people have had blood sugars over 100 but under 126 for years  known as prediabetes?",
      "Who can help to individualize a diabetes nutrition plan based on my age, health and weight goals, metabolic profile, type of medications used, and more?",
      "What can you tell me about qa nutrition and diabetes in this section, we answer your questions about nutrition and diabetes?",
      "What can you tell me about most of the commonly used blood glucoselowering medications for type 2 diabetes dont cause hypoglycemia?",
      "What can you tell me about nutritional recommendations for diabetes?",
      "What can you tell me about 20glucose monitoringan essential part of managing type 1 diabetes is glucose monitoring?",
      "What can you tell me about what is a good diet to follow for a person with diabetes who has a very active lifestyle??",
      "What can you tell me about pathways of empower ment perceptions, health literacy, selfefficacy, and selfcare behaviors to glycemic control in patients with type 2 diabetes mellitus?",
      "What to Know About Alcohol and Diabetes What About the Glycemic Index?",
      "What can you tell me about empowerment of patients with type 2 diabetescurrent perspectives?",
      "What can you tell me about diabetes educ 2009 35 641651?",
      "What can you tell me about there is likely a genetic component that places patients at risk, with some environmental influences as well.people who have type 1 diabetes must replace insulin every day through injections or infusion and monitor their blood glucose throughout the day?",
      "What can you tell me about the next steps are uncovering if the high blood sugar is due to the pancreas having lost the ability to make adequate insulin, and testing for higherthannormal levels of the antibodies that are often identified in type 1 diabetes.blood glucose testsyour healthcare provider may order the following tests to diagnose type 1 diabetes.random plasma glucose test, which checks if your blood sugar is too high and doesnt require fasting before your blood sample is drawn?",
      "What can you tell me about estimating life years lost to diabetes outcomes from analysis of national diabetes audit and office of national statistics data?",
      "What can you tell me about association between the physical activity level and the quality of life ofpatients with type 2 diabetes mellitus?",
      "What can you tell me about q can i get rid of diabetes??",
      "What can you tell me about while we all wish it would simply go away, this isnt possibleyet, says david marrero, ph.d., who has diabetes and is the director of the diabetes translational research center at the indiana university school of medicine?",
      "What can you tell me about jdrf.biniek jf, johnson w. spending on individuals with type 1 diabetes and the role of rapidly increasing insulin prices pdf?",
      "What can you tell me about 2. international diabetes federation?",
      "What can you tell me about the meal plan recommendations for people with type 1 diabetes are individualized, and yes, some people choose a lowcarb diet or even a very lowcarb diet?",
      "What can you tell me about diabetes becomes an integral part of a persons life?",
      "What can you tell me about prediabetes is generally 100125, but you will see different ranges for what is considered normal with some thinking that 80 is an ideal fasting level?",
      "What can you tell me about american diabetes association.type 1 diabetes?",
      "What can you tell me about dutta says this can happen to anyone with type 1 diabetes at any age, but if a person develops the disease in their middle or later years, the progression is typically more gradual, and they are therefore more likely to already be under a doctors care for high blood sugar.causes and risk factors of type 1 diabetesits unknown exactly what causes type 1 diabetes, but experts think it could be a combination of genetic and environmental factors?",
      "What can you tell me about if you have prediabetes or were just diagnosed with type 2, losing a lot of weight can put the condition into remission?",
      "What can you tell me about 37type 1 diabetes treatment can be very expensive?",
      "What can you tell me about having a disease like diabetes does provide greater challenges for stable health and moods, but does not negate the ability to attain and maintain them.q is it possible that weight gain and morphine use caused me to develop type 2 diabetes??",
      "What can you tell me about 34,38,52 dsme should be customised, meet the persons needs and take into account personal characteristics, such as medical history, age, health beliefs and attitudes, diabetes knowledge, physical limitations, family supportand ﬁnancial status?",
      "What can you tell me about prim care diabetes 2017 11 201211.lambrinou et al?",
      "What can you tell me about prim care diabetes 2015 9 385391?",
      "What can you tell me about lancet diabetes endocrinol 2016 4 913921?",
      "What can you tell me about this will also help your blood sugar numbers come down.q what is brittle diabetes?a brittle is a term used when one has had diabetes for a long time, and in spite of a solid focus on maintaining a healthy lifestyle and good medication management, it becomes harder to control blood sugars?",
      "What can you tell me about jdrf.diabetes tests and diagnosis?",
      "What can you tell me about people with diabetes need to eat a certain amount of carbs every day for energy and essential nutrients?",
      "What can you tell me about american diabetes association?",
      "Is there a chance that a blood test is wrong?A Type 1 diabetes means that without taking insulin, you cannot live.",
      "What can you tell me about diabetes mel litus statistics on prevalence and mortality facts and fallacies?",
      "Is it important to monitor blood sugar closely especially for people who take insulin or medication for their diabetes?",
      "Can it feel confusing to find accurate resources for meal planning for diabetes with many opinions available online and on social media today?",
      "What can you tell me about most people with type 2 diabetes, especially in the early years, can partner with a primary care provider who takes an active interest in their diabetes, argento says?",
      "What can you tell me about 6coxsackieviruses have been studied as possible triggers for type 1 diabetes, and prolonged viral infection may increase a childs risk for developing the disease?",
      "What can you tell me about top common questions about diabetes  special diets diabetes top common questions about diabetes whether you want to know the recommended blood sugar numbers or need advice on how to stay motivated, our experts have taken on the 20 most commonly asked diabetes questions so you have the answers you need to successfully manage your diabetes?",
      "Is honey ok to use if I have diabetes, and in what proportion?",
      "What can you tell me about marreros advice accept that diabetes will, for the rest of your life, be there?",
      "What can you tell me about update to a position statement of the american diabetes association and the european association for the study of diabetes?",
      "What can you tell me about what are good travel foods for people with diabetes??",
      "What can you tell me about ucsf diabetes education online.insulin basics?",
      "Is this related to his diabetes?A If his glucose levels have been elevated, he could be breaking down fat for fuel at a rapid rate.",
      "What can you tell me about the closer you get to more normal weight, the better your chances for better control with less medication.q why are people with diabetes supposed to be so careful about treating cuts and other injuries?a a person who has poorly controlled diabetes may find it takes longer to stop the bleeding or to heal the cut?",
      "Can all fruits can be included in a meal or snack when you have diabetes?",
      "What can you tell me about a diabetes left unchecked may be involved in a foot infection, which can certainly cause an odor?",
      "What can you tell me about november 8, 2017.rates of new diagnosed cases of type 1 and type 2 diabetes continue to rise among children, teens?",
      "What can you tell me about type 2 diabetes whats the difference?american diabetes association understanding type 1 diabetescenters for disease control and prevention about type 1 diabetesjohns hopkins medicine type 1 diabeteseditorial sources and factcheckingeveryday health follows strict sourcing guidelines to ensure the accuracy of its content, outlined in our editorial policy?",
      "What is a good diet to follow for a person with diabetes who has a very active lifestyle?",
      "What can you tell me about when it comes to diabetes, carbohydrate is looked at as per meal or snack, not per day?",
      "What can you tell me about diabetes educ 2019 45 3449?",
      "What can you tell me about mhealth interventions for diabetes remote monitoring and self management clinical and compliance issues?",
      "What can you tell me about she balances both outpatient and inpatient responsibilities, seeing a variety of patients with diabetes, as well as thyroid and pituitary disorders?",
      "What can you tell me about how to become an expert meal planner when you have diabetes how to manage eye health when you have diabetes 4 best burger king breakfast items to support your blood sugar, according to a dietitian 25 simple diabetesfriendly recipes to make with pantry staples can you eat dried fruit if you have diabetes??",
      "How many times a day should i eat?",
      "What can you tell me about while their journey will be different from the experience of those who dont have type 1 diabetes, they can still live a fulfilling, successful life, and they may find that their unique experience gives them the ability to tap into an inner power they didnt realize they had.dutta strikes a similarly optimistic tone?",
      "Can I Reverse My Diabetes?",
      "What can you tell me about q i was recently diagnosed with type 2 diabetes?",
      "What can you tell me about 45for persons with diabetes, online discussion groups are found to have a positive impact on patients conﬁdence and their ability to actively make decisions with the healthcare teamabout their condition?",
      "What can you tell me about im not saying that a general practitioner will not be helpful, but a primary care physician doesnt have the specialty knowledge to deal with type 1 diabetes, which is a very different disease from type 2 diabetes.prognosis of type 1 diabetesthe average person with a type 1 diabetes diagnosis who makes it to age 43 has a life expectancy that is nearly eight years shorter than someone the same age without that diagnosis, according to a study published in 2020?",
      "What can you tell me about i hope that this person is willing to do what is suggested to get glucoses into a more normal range.q i was recently diagnosed with type 2 diabetes and now i have my first bout of coldbronchitis since my diagnosis?",
      "What can you tell me about diabetes atlaseighth edition 2017 , httpswww.diabetesatlas.org 2017, accessed 11 may 2019?",
      "What can you tell me about research is ongoing and very active in the field of diabetes and genetic markers so updated information could be available in the near future.q i am not diabetic according to medical tests?",
      "What can you tell me about racialethnic minority youth with recentonset type 1 diabetes have poor prognostic factors?",
      "What can you tell me about thanks for your feedback tell us why other submit related articles the best time to check blood glucose after a meal what you should know about diabetes  the coronavirus can people with diabetes consume sugar??",
      "What can you tell me about the benefits of yoga practice compared to physical exercise inthe management of type 2 diabetes mellitus a systematic review and metaanalysis?",
      "What can you tell me about 15duration of type 1 diabetestype 1 diabetes is a lifelong illness that requires careful, daily management of blood sugar levels?",
      "What can you tell me about q my 12 year old daughter has been diagnosed with prediabetes from a blood test?",
      "What can you tell me about 2018.national diabetes statistics report 2020 estimates of diabetes and its burden in the united states pdf?",
      "What can you tell me about 9having a close family relative who has type 1 diabetes 1in fact, the odds that a man with type 1 diabetes has a child who develops it are 1 in 17?",
      "What can you tell me about a very active person who takes insulin or medication for their diabetes will want to make sure not to skip meals and plan to eat on time?",
      "What can you tell me about with diabetes, you may find you now respond to illness differently so do not hesitate to talk to your health care team if you have any questions.q how can i prevent diabetes??",
      "What can you tell me about following a healthy lifestyle and eating whole foods is most important with or without medication.q how can i help my young adult son with type 1 diabetes get a good night sleep??",
      "What can you tell me about ucsf diabetes education online.dietary guidelines for americans 20152020 eighth edition pdf?",
      "What can you tell me about 1how type 1 diabetes raises blood sugarin the normal digestive process, your body breaks down much of the food you eat into glucose, a simple sugar thats stored in your body and used for energy?",
      "What can you tell me about but they do it in very different ways.as mentioned, type 1 diabetes is an autoimmune disorder that results in the body being able to produce little or no insulin?",
      "What can you tell me about this is referred to as type 1.5 diabetes?",
      "What can you tell me about fluctuations in the incidence of type 1 diabetes in the united states from 2001 to 2015 a longitudinal study?",
      "Is it appropriate to meet with a registered dietitian nutritionist?",
      "What can you tell me about revisit this with your health care team and ask them what their blood sugar criteria is.q how does smoking affect diabetes?a diabetes is considered a cardiovascular disease and smoking negatively affects the cardiovascular system?",
      "What can you tell me about people with diabetes should not eat potatoes, rice, or pasta?",
      "What can you tell me about the following information can help you to separate fact from fiction on nutrition and diabetes myths ",
      "Is there one size fits all diet for people with diabetes?",
      "What can you tell me about meeting with a licensed healthcare professional?",
      "What can you tell me about but the recommended amount of carbs for most people with diabetes in general is 45 to 65 percent of total daily calories?",
      "What can you tell me about is there a chance that a blood test is wrong?a type 1 diabetes means that without taking insulin, you cannot live?",
      "What can you tell me about muscle atrophy in patients with type 2 diabetes mellitusroles of inflammatory pathways, physical activity and exercise?",
      "What can you tell me about we asked our diabetes experts to answer 20 of your mostasked queries?",
      "What can you tell me about your doctor is right in that diabetes is very well managed when one is living a healthy lifestyle?",
      "What can you tell me about this is more often the case with insulin dependent diabetes?",
      "What can you tell me about effects of aer obic and resistance training on hemoglobin a 1c levels inpatients with type 2 diabetes a randomized controlled trial?",
      "What can you tell me about what are the nutritional recommendations for individuals adults with type 1 diabetes in terms of daily carbohydrate intake??",
      "What can you tell me about february 1, 2022.type 1 diabetes?",
      "Can I meet with a doctor?",
      "What can you tell me about in 2015, social media use has shown added valuefor selfmanagement in chronic conditions, includingdiabetes?",
      "What can you tell me about it can also feel confusing to find accurate resources for meal planning for diabetes with many opinions available online and on social media today?",
      "What can you tell me about since carbohydrate is the nutrient in food that has the greatest effect on blood sugar, many people with diabetes tend to focus only on carbohydrate counting?",
      "What can you tell me about a diabetes in and of itself does not generally cause you to retain weight?",
      "What can you tell me about diabetes meal planning chart download this free handy guide to meal planning and carbohydrate counting to keep on your fridge, phone, or purse?",
      "What can you tell me about a preplanning and having healthy snacks at the ready are keys to helping you eat healthy on the road, says lisa brown, rd, cde, of brownfox solutions in minneapolis and chair of the academy of nutrition and dietetics diabetes care and education practice group?",
      "What can you tell me about diabetes health platforms have built a diabetes digital ecosystem by incorporating large amounts of realworld data?",
      "What can you tell me about 25prevention of type 1 diabetesdoctors arent aware of a way to prevent type 1 diabetes, but researchers have made progress and are continuing to explore ways to do so or at least slow its progression?",
      "What Is Type 1 Diabetes?",
      "What can you tell me about you didnt develop diabetes over night you may have been prediabetic for some time?",
      "What can you tell me about will my diabetes ever go away??",
      "Is a keto diet is best for diabetes?",
      "What can you tell me about a frequent urination, rapid weight loss, dizziness, and excessive thirst are just some of the symptoms associated with, but not exclusive to diabetes?",
      "What can you tell me about consult your healthcare professional hcp or rdn for an individualized meal plan, as there are many factors that contribute to nutrition recommendations for your diabetes care plan?",
      "What can you tell me about be mindful of chlorine which may be irritating.q do people with diabetes need to use special toothpaste??",
      "What can you tell me about you can control diabetes by avoiding sugar?",
      "What should a very active person who takes insulin or medication do for their diabetes?",
      "What can you tell me about the following information can help you to separate fact from fiction on nutrition and diabetes 6 diabetes myths about nutrition nutritional recommendations for diabetes qa nutrition and diabetes the american diabetes association ada notes that eating well is an important tool in your diabetes management plan?",
      "Should people with diabetes should avoid certain fruits?",
      "What can you tell me about 35each year there are an estimated 64,000 new cases of type 1 diabetes in people under age 64 in the united states 27,000 youths and 37,000 adults?",
      "What can you tell me about collective empowerment strategies for patients with diabetes mellitus a systematic review and metaanalysis?",
      "What can you tell me about i am 14 and overweight and diabetes runs in my family.a be very active, and learn as much as you can about healthy eating?",
      "What can you tell me about the best and worst fruits to eat if you have diabetes7day diabetes diet dinner plan was this page helpful??",
      "What can you tell me about he does need to take this seriously, see his physician assuming he has one, and follow with a diabetes eatinglifestyle plan?",
      "What can you tell me about factors associated with glycaemic control in patients with diabetes mellitus a systematic literature review?",
      "What can you tell me about effectiveness of groupbased selfmanagement education for individualswith type 2 diabetes a systematic review with meta analyses and metaregression?",
      "What can you tell me about the average yearly cost spent on insulin by people with type 1 diabetes was 5,705 in 2016?",
      "What can you tell me about a great resource to look up fruit portion sizes is choose your foods food lists for diabetes from the ada?",
      "What can you tell me about 57 the national standards for diabetes selfmanagement education and support de ene diabetes selfmanagement education dsme as, a collaborative and ongoing pro cess intended to facilitate the development of knowledge, skills, and abilities that are required for successfulselfmanagement of diabetes p. 1?",
      "What can you tell me about 4diabetes 101 what are the different types of diabetes?next up video playing in 10 secondssigns and symptoms of type 1 diabetessymptoms of type 1 diabetes can develop rapidly, especially in young people, says sanjoy dutta, phd, chief scientific officer for the type 1 diabetes research organization jdrf?",
      "What can you tell me about clin diabetes endocrinol 2018 4?",
      "What can you tell me about 12other diagnostic tests the following may also be ordered to diagnose type 1 diabetes 12cpeptide test measures a byproduct of insulin production and can show how much insulin your body is making, paired with a glucose value.insulin assay test detects the levels of insulin in your blood, but is less commonly used and more variable than a cpeptide test.dutta recommends seeing an endocrinologist for treatment if youre diagnosed with type 1 diabetes?",
      "What can you tell me about the constant need to be thinking about diabetes can grow tiresome and frustrating for many young people, says thomas?",
      "What can you tell me about smoking cessation, weight change, type 2 diabetes, and mortality?",
      "What can you tell me about 1the international diabetes federation idf estimatedthere were 451 m people with dm worldwide in 2017and that number will increase to 693 m by 2045?",
      "What can you tell me about in the correct serving size, all fruits can be included in a meal or snack when you have diabetes?",
      "What can you tell me about with childhood obesity so common now, we are seeing type 2 diabetes at much younger ages?",
      "What can you tell me about with an active lifestyle, it is important to monitor blood sugar closely  especially for people who take insulin or medication for their diabetes  in order to prevent a low blood sugar?",
      "What can you tell me about a if you have type 2 diabetes and were put on insulin, its likely you need it to bring your blood sugar down farther than pills could?",
      "What can you tell me about 35research and statistics how many people have type 1 diabetes and who are they?type 1 affects people of all ages?",
      "What can you tell me about use of commonly available technologies for diabetes information and self management among adolescents with type 1 diabetes andtheir parents a webbased survey study?",
      "What are the nutritional recommendations for  adults with type 1 diabetes in terms of daily carbohydrate intake?",
      "What can you tell me about intensive patient edu cation improves glycaemic control in diabetes compared to conventional education a randomised controlled trial in a nigerian tertiary care hospital?",
      "What can you tell me about effectiveness of individual strategies for the empowerment of patients with diabetes mellitus a systematic review with metaanalysis?",
      "What can you tell me about effect of a nurseled diabetes selfmanagement education program on glycosylated hemoglobin among adults with type 2 diabetes.j diabetes res 2018 4930157?",
      "What can you tell me about this applies to both type 1 and type 2 diabetes.q does fasting make diabetes symptoms worse??",
      "What can you tell me about strand was the first person with diabetes to win the amazing race tv show?",
      "What can you tell me about impact of infor mation technologybased interventions for type 2 diabetes mellitus on glycemic control a systematic reviewand metaanalysis?",
      "What can you tell me about how do i accept diabetes??",
      "What can you tell me about strategiessuch as the above can be useful to enhance personscommitment to diabetes selfmanagement?",
      "What can you tell me about national standards for diabetes selfmanagement education and support.diabetes care 2012 38 23932401?",
      "What can you tell me about a taking care of diabetes and getting through your daily todo list along with your other responsibilities is demanding?",
      "What can you tell me about in some cases, it might even be 10 kilos 22 pounds of weight loss within two weeks.the onset of type 1 diabetes can be difficult to detect in very young children, says dr. thomas?",
      "What can you tell me about december 2019.diabetes risk factors?",
      "What can you tell me about carpenter r, dichiacchio t and barker k. interventions for selfmanagement of type 2 diabetes an integrativereview?",
      "What can you tell me about diabetes care 2019 42 13331339?",
      "What can you tell me about its an essential monitoring supply that many people dont know about or use, says janine freeman, rdn, cde, a member of the american association of diabetes educators board of directors?",
      "What can you tell me about july 15, 2018.recentonset type 1 diabetes trial evaluating efficacy and safety of teplizumab protect?",
      "What can you tell me about 7880it is impressive that smoking is higher in people with chronic diseases, such as dm,even after the diagnosis?",
      "What can you tell me about april 5, 2022.learn the genetics of diabetes?",
      "What can you tell me about eventually, however, it can no longer make enough insulin to handle spikes in glucose levels, such as routine rises in blood sugar after a meal.type 2 diabetes accounts for 90 to 95 percent of all diagnosed cases of diabetes?",
      "What can you tell me about 14how well you manage type 1 diabetes can affect your life expectancy.in another study, also published in 2015, researchers found that people with type 1 diabetes who underwent intensive treatment for 6.5 years experienced a modestly reduced risk of complications and a lower overall risk of early death?",
      "What can you tell me about nutritional recommendations for diabetes there is no one meal planning method or diet for diabetes?",
      "What can you tell me about a cautionary note to people with type 1 diabetes significant alcohol intake can cause hypoglycemia a number of hours later, so regularly check blood sugar levels when you drink?",
      "is a keto diet appropriate for people with diabetes?",
      "What can you tell me about diabetes selfmanagement educationand nutritional counselling are integral parts of anytherapeutic programme throughout the disease course.this will ensure that the patient has access to information on methods to safely monitor and control bloodglucose levels?",
      "What can you tell me about do the math 25 million people have diabetes there are not nearly enough endocrinologists?",
      "What can you tell me about once you are shown, then you can practice and more assured of the readings you are getting.q does obesity cause type 2 diabetes?a obesity is not the cause of type 2 diabetes, but is a strong contributor if one is genetically disposed?",
      "What can you tell me about 9health profes sionals hps should tailor their patient selfcare sup port based on the degree of personal responsibility the patient is willing to assume towards their diabetes selfcare management?",
      "What can you tell me about the risk of being diagnosed with type 1 diabetes is approximately 1.5 times higher for males than for females, says thomas.having autoantibodies that are associated with higher risk 1being of european descent although people of any race or ethnicity can develop it?",
      "What can you tell me about type 2 diabetes is much more common than type 1.q is it normal for someone to go from healthy to insulin diabetic very quickly??",
      "What can you tell me about developing healthy eatinglifestyle habits now is most important.q how do i find out whether i am type 1 or type 2 diabetes??",
      "What can you tell me about many people believe that following a keto or very low carbohydrate diet helps improve their blood sugar and decreases or eliminates their need for medication or insulin in type 2 diabetes?",
      "What can you tell me about nutrition?  ",
      "What can you tell me about there are those with type 2 diabetes who do require insulin to have any semblance of good levels, but can survive without insulin for some period of time, but with high levels?",
      "What can you tell me about the role of health literacy in diabetes knowledge, selfcare, and gly cemic control a metaanalysis?",
      "What can you tell me about related articles tips 10 ways to control your diabetes tips  resources read article nutrition, tips meal planning  exercise tips for insulin resistance read article diabetes, fitness, health, lifestyle, tips 12 helpful health apps for diabetes glucose tracking, nutrition  more read article were looking for talented, passionate people to join our team?",
      "What can you tell me about medtronics minimed 670g and 770g hybrid closedloop systems, and tandem diabetes cares closedloop controliq are fdaapproved artificial pancreases, he says.jet injection instead of a needle, an injector with an insulin cartridge delivers insulin beneath the skin via a jet of air?",
      "Are there any dietary patterns that affect diabetes and overall health?",
      "How do I know when I should see my doctor vs. let the illness run its course?A When you have diabetes and are ill enough to where your blood sugars go too high andor your illness doesnt come under control in a normal course, you should certainly seek medical attention.",
      "What can you tell me about american diabetes association.insulin types and usage?",
      "What can you tell me about prediabetes is just now being more aggressively focused upon for diabetes prevention?",
      "What can you tell me about 2with type 1 diabetes, the bodys immune system attacks and destroys the pancreass insulinproducing beta cells?",
      "What can you tell me about the most important factor is that he wants to take steps to sleep better and overall maintain a better quality of life.q i read that with type 2 diabetes, the production of insulin goes down with age?",
      "What can you tell me about symptoms, causes, diagnosis, and treatment type 1 diabeteswhat is type 1 diabetes??",
      "What can you tell me about q my husband has type 2 diabetes and is a truck driver?",
      "What can you tell me about for general guidelines on the portions of carbohydrate, protein, and fat to aim for in a typical meal, view our article on meal planning for diabetes?",
      "What can you tell me about there is no one diet or meal planning method for all people with diabetes?",
      "What are the chances that my child will develop type 1 as well?A While there is a genetic component to type 1 diabetes, environmental factors play a role as well.",
      "What can you tell me about complications of diabetes, such as nerve damage or the risk of low blood sugar, may require adjustments in how you exercise?",
      "What can you tell me about research shows moderate alcohol consumption has minimal short or longterm effects on glucose levels in people with type 1 or 2 diabetes, says marion franz, rd, cde, owner of nutrition concepts by franz in minneapolis?",
      "What can you tell me about mcgowan p, lynch s and hensen f. the role and effect iveness of telephone peer coaching for adult patients with type 2 diabetes?",
      "What can you tell me about aside from journalism, her passions include running, fitness, and healthy living.see full biosee our editorial policymeet our health expert networksign up for our diabetes newsletterenter your emailsubscribeby subscribing you agree to the terms of use and privacy policy?",
      "What can you tell me about 22,23 education and support for selfmanagement are fundamental when caring for people with a chronic disease like diabetes?",
      "What can you tell me about q can i get rid of type 2 diabetes if i stop eating carbs andor lose a lot of weight??",
      "What can you tell me about august 15, 2019.preventing diabetes problems?",
      "What can you tell me about may 2018.additional sourcesfda approves first drug that can delay onset of type 1 diabetes?",
      "What can you tell me about selfmanagement education should be customised and meet the peoples needs taking intoaccount their disease experience, personal characteristics, such as medical history, age, health beliefs andattitudes, diabetes knowledge, health literacy, physicallimitations, family support, ﬁnancial status and sociocultural factors?",
      "What can you tell me about a no, the diagnosis of a child is not always type 1 diabetes?",
      "What can you tell me about diabetes, metab syndr obes targets ther 2019 12 13111321?",
      "What can you tell me about nearly 40 percent of covid19 deaths in the united states during the first few months of the pandemic happened to people who had diabetes?",
      "What can you tell me about a reading higher than 126 mgdl points to diabetes?",
      "What can you tell me about the pain may stop when you sit because your muscles then require less blood flow, says marjorie cypress, ph.d., cnp, cde, a nurse practitioner in albuquerque and president of health care and education for the american diabetes association?",
      "What can you tell me about if you are experiencing any symptoms such as weakness, frequent urination, increased hunger or thirst, or frequent infections, then get a fasting test now.q is it possible to stop being diabetic?a once you have diabetes, you will always have it, but you can manage it to the point that it appears as if you dont have it?",
      "What can you tell me about she completed her fellowship in endocrinology, diabetes, and metabolism in 2017 at stanford university in california.she loves running, dancing, and watching her sons play sports.see full biosheryl huggins salomonauthorsheryl huggins salomon has spent her career equipping people with information to help improve their wellbeing and prospects in life?",
      "What can you tell me about there is no ideal percentage of calories from carbohydrate, protein, and fat that applies to all people with diabetes?",
      "What can you tell me about an a1c of 6.5 or higher indicates diabetes?",
      "What can you tell me about take charge of your lifestyle habits and get all the education you can on managing this disease.q how does diabetes affect your mood and thinking process?a with or without diabetes, when blood sugars are not in balance, fatigue, dizziness, fuzzy thinking, mood swings, and other symptoms may result?",
      "Should people with diabetes avoid certain fruits?",
      "What can you tell me about relation of smoking with total mortality and cardiovascular events among patients with diabetes mellitus a metaanalysis and systematic review?",
      "What can you tell me about however, there are some nutrition recommendations for diabetes that most people are advised to follow eat at least three times a day to keep blood sugar stable?",
      "What can you tell me about studies found it delayed the onset of type 1 diabetes by an average of two years in people who had relatives with the disease?",
      "What can you tell me about understanding the physical, social, and emotional experiences of people with uncontrolled type 2 diabetes a qualitative study?",
      "Is that always type 2?A Those diagnosed with type 2 diabetes will still produce insulin.",
      "What can you tell me about 100 is prediabetes?",
      "What can you tell me about diabetes care 2015 38 15361543?",
      "What can you tell me about association between 7 years of intensive treatment of type 1 diabetes and longterm mortality?",
      "What can you tell me about is that always type 2?a those diagnosed with type 2 diabetes will still produce insulin?",
      "What can you tell me about for general guidelines on the portions of carbohydrate, protein, and fat for diabetes?",
      "What can you tell me about july 2022.diabetes autoantibody panel?",
      "What can you tell me about what are the nutritional recommendations for individual adults with type 1 diabetes in terms of daily carbohydrate intake??",
      "What can you tell me about we use only trustworthy sources, including peerreviewed studies, boardcertified medical experts, patients with lived experience, and information from top institutions.resourcestype 1 diabetes?",
      "What can you tell me about december 2015.diabetes diet, eating, and physical activity?",
      "What can you tell me about a fasting blood sugar of 126 repeated twice is a diagnosis of diabetes?",
      "What can you tell me about factors influencing selfmanagement in patients withtype 2 diabetes a quantitative systematic review proto col.j adv nurs 2014 70 187200?",
      "What can you tell me about if your body truly no longer makes insulin, as the case with type 1 diabetes, and you are not injecting insulin, you will die?",
      "What can you tell me about a good plan right now is to align yourself with someone who understands healthy eating for diabetes, and become as active as you can.q will losing a large amount of weight help me to avoid the diabetes that runs in my family??",
      "What can you tell me about a it is possible to have your production of insulin cease over time, but usually this is not the case for type 2 diabetes?",
      "What can you tell me about communitybased peerled diabetes selfmanagement a randomized trial?",
      "What can you tell me about research suggests that genes account for less than half the risk for developing type 1 diabetes?",
      "What can you tell me about there are no fruits that people with diabetes should avoid?",
      "What can you tell me about curr opin endocrinol diabetes obes 2013 20 389395?",
      "What can you tell me about 3type 2 diabetes develops when liver, muscle, and fat cells dont respond properly to insulin and become insulin resistant?",
      "What can you tell me about national institute of diabetes and digestive and kidney diseases?",
      "What can you tell me about empowerment assessment and influential factors among patients with type 2 diabetes?",
      "What can you tell me about research indicates that if type 2 diabetes is treated early and blood sugar is controlled initially and over the years, the pancreas is more likely to produce enough insulin longer?",
      "What can you tell me about diabetes myths can make nutrition and diabetes management confusing?",
      "What can you tell me about hopes books include diabetes meal planning made easy and eat out eat wellthe guide to eating healthy in any restaurant, and she has also written a nutrition qa column for the washington post?",
      "What can you tell me about eatingwells editorial guidelines published on september 28, 2018 close common questions about diabetes diabetes information is available almost everywhere?",
      "What can you tell me about cypress suggests lowering your risks for pad with the same advice you follow to stay healthy with diabetes?",
      "Is honey ok to use if i have diabetes, and in what proportion??",
      "What can you tell me about this can definitely interfere with metabolism and good blood sugar control.q what impact would my husbands diabetes have on our future child if we decide to have a baby?a it is not a given that you would give birth to a child with diabetes though the genes may be present?",
      "What can you tell me about if you maintain good levels that have been established with your physician, then healing times should be similar to anyone else who is basically healthy.q can diabetes cause a persons feet to have a bad odor??",
      "What can you tell me about the big if is whether your pancreas still makes enough insulin to get your glucose down, says dan kent, pharm.d., cde, a specialty clinical pharmacist with group health in seattle and member of the american association of diabetes educators board of directors?",
      "What can you tell me about with insulinrequiring diabetes, this can be an even greater challenge to maintain stable blood sugars, but is very achievable with the right monitoring and support?",
      "What can you tell me about related articlessee all in type 1 diabetesdiabetesfda says shortages of glp1 drugs mounjaro and zepbound are overpublished ondecember 23, 2024type 1 diabeteswhat is the honeymoon phase in type 1 diabetes?medically reviewedbyelise m. brett, mddecember 17, 2024type 2 diabetestype 2 diabetes a start guide for exercisemedically reviewedbysandy bassin, mddecember 13, 2024type 2 diabetesis prediabetes a useful diagnosis??",
      "What can you tell me about top common questions about diabetes  found hoka, nike, and more of our favorite walking shoes, up to 50 off?",
      "What can you tell me about however, its important to remember that people with diabetes, just like anyone else, want to eat a balanced diet to keep their body healthy and prevent other diseases, such as heart disease?",
      "What can you tell me about j diabetes metab disord 2013 12 6?",
      "What can you tell me about concept of knowledgebased selfmanagement pathways for the empowerment of diabetes patients?",
      "What can you tell me about q is it true that complications of diabetes can be delayed and even prevented??",
      "What can you tell me about 19bipoc and type 1 diabetesalthough type 1 diabetes is most prevalent in the united states among white people, hispanic 4.4 percent, nonhispanic asian and pacific islander 4.0 percent, and black 2.7 percent children and youths saw the steepest annual percentage increases in cases between 2002 and 2015?",
      "What can you tell me about education and support for selfmanagement are fundamental when caring for people with a chronic disease like diabetes mellitus?",
      "What can you tell me about exploring how patients understand and assess their diabetes con trol?",
      "What can you tell me about i had a morphine pump that leaked into my bloodstream and all through my body when it wasnt supposed to for about a month and, as a result, i gained in excess of 50 pounds.a the stress that caused you to be placed on the pump in the first place, plus the probability that you have a genetic disposition to diabetes, triggered further by weight gain, is now surfacing as diabetes?",
      "What can you tell me about association of the magnitude ofweight loss and changes in physical fitness with long term cardiovascular disease outcomes in overweight or obese people with type 2 diabetes a posthoc analysisof the look ahead randomised clinical trial?",
      "What can you tell me about determinants of hospitalization in chinese patients with type 2 diabetes receiving a peer support intervention and jade integrated care the pearl randomised controlled trial?",
      "What can you tell me about diabetes care 2016 39 e1e2?",
      "What can you tell me about 39common questions  answerswhat is the difference between type 1 and type 2 diabetes?type 1 and type 2 diabetes both result in blood sugar that is too high?",
      "What can you tell me about just because there is diabetes in your family, it doesnt mean you have to get it if you start now with lifestyle changes?",
      "What Are Good Travel Foods for People with Diabetes?",
      "What can you tell me about the meal plan recommendations for people with type 1 diabetes? ",
      "Can you control diabetes by avoiding sugar?",
      "What can you tell me about aerobic fitness and adherence to guidelinerecommended minimum physicalactivity among ambulatory patients with type 2 diabetesmellitus?",
      "What can you tell me about diabetes care?",
      "What can you tell me about always ask your pharmacist when you arent clear about the best product to buy for diabetes.q it has been just a few weeks since my diagnosis of type 2 diabetes and i am a bit freaked out because ive yet to see anybody mention their a1c being anywhere in the same ball park as mine, which is 11?",
      "What can you tell me about q does a diagnosis of type 2 diabetes mean i will have to go on insulin??",
      "What can you tell me about a for most people with diabetes, the american diabetes association recommends a fasting or beforemeals blood glucose or blood sugar goal of 70130 mgdl?",
      "How often should i visit the doctor?",
      "What can you tell me about what is type 1 diabetes??",
      "What can you tell me about diabetes nutrition?",
      "What can you tell me about eat foods like bread, crackers, pretzels, dry cereal, 100 percent fruit juice, or sports drink with calories, says gary scheiner, cde, an exercise physiologist and owner of integrated diabetes services near philadelphia?",
      "What can you tell me about meeting with a licensed healthcare professional, including a registered dietitian nutritionist, can help to individualize a diabetes nutrition plan based on your age, health and weight goals, metabolic profile, type of medications used, and more?",
      "What can you tell me about 33exercisephysical activity is another important aspect of diabetes management?",
      "What can you tell me about effects of tele phonebased peer support in patients with type 2 diabetes mellitus receiving integrated care a randomized clinicaltrial?",
      "What can you tell me about a changing your lifestyle which will ultimately result in body composition changes and weight reduction can certainly keep diabetes in check?",
      "What can you tell me about telehealth technologies changing the way we deliver efficacious and costeffective diabetes selfmanagement education.j health care poor underserved 2014 25 18531897?",
      "What can you tell me about 6 diabetes myths about nutrition the many diabetes myths surrounding nutrition can make deciding what to eat confusing?",
      "What can you tell me about diabetes metab syndr clin res rev2018 12 795805?",
      "What can you tell me about symptoms, causes, diagnosis, and treatmentbysheryl huggins salomonmedically reviewedbykacy church, mdupdated on february 18, 2023on this pageon this pagetype 1 diabetes is an autoimmune disease that leads the body to stop making enough insulin to keep glucose sugar at a healthy, normal level?",
      "Is there an ideal percentage of calories from carbohydrate, protein, and fat that applies to all people with diabetes?",
      "What can you tell me about 30dieta registered dietitian nutritionist rdn, and especially one who is also a certified diabetes care and education specialist cdces, can help you to find the meal plan that is right for you?",
      "Can People with Diabetes Eat Bread?",
      "What can you tell me about prim care diabetes 2018 12 97110?",
      "What can you tell me about melissa has held various sales and marketing positions for leading companies in the diabetes space including insulin pump, blood glucose monitor, and diabetes supply distribution companies?",
      "What can you tell me about the importance of health belief models in determining selfcare behaviour in diabetes?",
      "What can you tell me about in fact, the ada recommends an individualized approach to nutrition and diabetes?",
      "What can you tell me about role of selfcare in management of diabetes mellitus.j diabetes metab disord 2013 12 14?",
      "What can you tell me about 13that is slightly less than the life expectancy reported in a 2015 scottish study that found men with type 1 diabetes at age 20 had a life expectancy about 11 years shorter than men who didnt have the disease?",
      "What can you tell me about a yes research shows that the earlier your diabetes is diagnosed and the sooner you start to aggressively get your blood sugar, blood pressure, and cholesterol into target ranges, the healthier you can be over the years?",
      "What can you tell me about q how can i learn to accept my diabetes??",
      "What can you tell me about diabetes meal planning ",
      "What can you tell me about but 58 percent of new cases of type 1 diabetes in the united states each year are diagnosed in adults.how is type 1 diabetes treated?people with the disease are given insulin therapy?",
      "What can you tell me about this is certainly truer of those on the path to type 1 diabetes?",
      "What can you tell me about its also not healthy, because you wont get essential nutrients, says jojo dantone, rd, cde, a diabetes program coordinator in new orleans?",
      "What can you tell me about with perseverance, you can stay in control.q can diabetes prevent someone from losing weight??",
      "What can you tell me about q is diabetes causing me to be tired and sleepy after eating?a elevated blood sugar levels send a signal to the brain to release serotonin, a hormone that is both calming and sleep inducing?",
      "What can you tell me about with type 2, some people take insulin to help get glucose levels under control, but by adopting a more healthy lifestyle with dietexercise, levels can begin to come under better control and insulinmedication may not required.q i read that people with diabetes should not use heating pads?",
      "What can you tell me about 26,27type 1 diabetes complicationshaving prolonged high blood sugar can lead to a host of health problems?",
      "What can you tell me about while the patient still needs to be very involved with his or her own diabetes management, these devices offer a helping hand.other type 1 diabetes treatmentslesscommon type 1 diabetes treatments includeartificial pancreas an increasingly common treatment, this cuttingedge device combines an insulin pump, a cgm, and a dosing algorithm, says dutta?",
      "What can you tell me about type 1 diabetes often comes on fast and strong, with rapid weight loss, thirst, frequent urination, then stabilizes for a period until the cells stop insulin production?",
      "What can you tell me about can people with diabetes eat bread??",
      "What can you tell me about 2019 esc guide lines on diabetes, prediabetes, and cardiovascular diseasesdeveloped in collaboration with the easd?",
      "What can you tell me about what to know about alcohol and diabetes what about the glycemic index??",
      "What can you tell me about management of hyperglycaemia in type 2 diabetes, 2015 a patientcentred approach?",
      "What can you tell me about development of a patient decision aid for type 2 diabetes mellitus for patients not achieving glycemic control on metformin alone?",
      "What can you tell me about be most dedicated to yourself now, as 170 fasting would indicate diabetes?",
      "What can you tell me about diabetes care 2017 40 s33s43?",
      "What can you tell me about 17the national standards for diabetes selfmanagement education and support deﬁne diabetesselfmanagement education as a collaborative andongoing process intended to facilitate the developmentof knowledge, skills and abilities that are required for successful selfmanagement of diabetes?",
      "What can you tell me about general diabetes nutrition questions q?",
      "What can you tell me about diabetes technologies can be used to empower people with dm and improve their selfcare?",
      "What can you tell me about people with type 2 diabetes may or may not ever need to take insulin injections, depending on several factors, including the timing of diagnosis?",
      "What can you tell me about estimated life expectancy in a scottish cohort with type 1 diabetes, 20082010?",
      "What can you tell me about when it comes to diabetes, carbohydrate is looked at per meal and snack, not per day?",
      "What can you tell me about a weight loss is vital, particularly just after a diagnosis of type 2 or prediabetes?",
      "What can you tell me about browse our site to see many more diabetes questions and answers.q if my father has type 2 diabetes, does that mean that i am more likely to get it also?a you may have the genetic foundation for developing diabetes, but it is not inevitable?",
      "What can you tell me about a yes, adults with diabetes can drink alcohol and should follow the same guidelines as the general publican average of up to one drink per day for women and up to two drinks per day for men, with no more than three or four drinks in any single day for women and men, respectively?",
      "What can you tell me about this the same caution for any wound, especially on the feet, which is why people with diabetes are encouraged to check feet daily for even a small splinter?",
      "What can you tell me about questions and answers about diabetes  diabetes action research and education foundation 0 general information back to qa general questions about diabetes that have been answered by a diabetes educator?",
      "What can you tell me about here are some more facts and figures on type 1 diabetestype 1 diabetes affects at least 1.4 million adults ages 20 years or older  or 5.2 percent of all adults who have been diagnosed with diabetes?",
      "What can you tell me about they also monitor their blood glucose throughout the day, using a meter or continuous glucose monitor, to ensure that they are getting the correct doses of insulin.can type 1 diabetes go away?no, unfortunately, it cannot?",
      "What can you tell me about digital health technol ogy and mobile devices for the management of diabetes mellitus state of the art?",
      "What can you tell me about is this related to his diabetes?a if his glucose levels have been elevated, he could be breaking down fat for fuel at a rapid rate?",
      "What can you tell me about jdrf.how an rdn can help with diabetes?",
      "What can you tell me about people with diabetes should avoid certain fruits?",
      "What can you tell me about a once you are diagnosed with type 1 or type 2 diabetes, you have it for the rest of your life?",
      "What can you tell me about share on twittershare on facebookshare on linkedin written by melissa herrmann dierks , rdn, ldn, cdces melissa herrmann dierks rdn, ldn, cdces is a registered dietitian nutritionist, certified diabetes care and education specialist, and licensed dietitian nutritionist in huntersville, nc with over twentyfive years of professional experience in the field of nutrition and diabetes education?",
      "What can you tell me about type 2 diabetes?",
      "What can you tell me about carbohydrates?",
      "What can you tell me about unless lifestyle changes are made towards better eating habits and activity, prediabetes will usually blossom into diabetes.q if a 13 year old is diagnosed with diabetes, is it always type 1 and necessary to be on insulin or can it be controlled by diet??",
      "What can you tell me about 10how is type 1 diabetes diagnosed?testing for the diagnosis of type 1 diabetes first involves testing for abnormally high blood sugar, says thomas?",
      "What can you tell me about a yearly visit to a podiatrist is recommended for persons with diabetes?",
      "Is there one diet or meal planning method for all people with diabetes?",
      "What can you tell me about the association between selfmanagement barriers and selfefficacy inchinese patients with type 2 diabetes the mediatingrole of appraisal?",
      "What can you tell me about but, he adds, continuing advances in glucose monitoring and insulin delivery are making it easier for people to manage life with the disease.treatment and medication options for type 1 diabetesthe cornerstone of type 1 diabetes management continues to be insulin therapy, says thomas?",
      "How Do I Accept Diabetes?",
      "What can you tell me about 90 of children who develop type 1 diabetes do not have a relative with this disease and it is reported that only 15 of people with type 1 diabetes have a firstdegree relative, such as a parent, with diabetes?",
      "What can you tell me about how do i know when i should see my doctor vs. let the illness run its course?a when you have diabetes and are ill enough to where your blood sugars go too high andor your illness doesnt come under control in a normal course, you should certainly seek medical attention?",
      "What can you tell me about quantifying the association between physical activity and cardiovas cular disease and diabetes a systematic review and meta analysis?",
      "What can you tell me about diabetes self management education for adults with type 2 diabetes mellitus a systematic review of the effect on glycemic control?",
      "What can you tell me about special diets diabetes top common questions about diabetes whether you want to know the recommended blood sugar numbers or need advice on how to stay motivated, our experts have taken on the 20 most commonly asked diabetes questions so you have the answers you need to successfully manage your diabetes?",
      "What can you tell me about testing for ketones is also important if you truly have gestational diabetes?",
      "What can you tell me about type 2 diabetestype 1 and type 2 diabetes produce the same result blood sugar that is too high?",
      "What can you tell me about it is better late than never its time to find outq i have type 1 diabetes?",
      "What can you tell me about the signs of something wrong may be more subtle, such as more wet diapers or heavier diapers, bedwetting, and increased thirst.diabetic ketoacidosis dkaanother symptom of type 1 diabetes can be lifethreatening, and particularly for young people who are less likely to understand what they are going through, says dutta?",
      "What can you tell me about i know i am at high risk of getting diabetes but when i diet, it doesnt make a difference and i cant lose weight?",
      "What can you tell me about march 25, 2021.type 2 diabetes?",
      "What are the nutritional recommendations for individuals adults with type 1 diabetes in terms of daily carbohydrate intake?",
      "What can you tell me about is honey ok to use if i have diabetes, and in what proportion??",
      "What can you tell me about a while diabetes is an endocrine disease and falls under the specialty of an endocrinologist, there are only 3,000 of us in the u.s. who treat diabetes, says nicholas argento, m.d., an endocrinologist with maryland endocrine near baltimore who has type 1 diabetes?",
      "What can you tell me about they include 28heart diseasestrokekidney diseaselow blood sugar, or hypoglycemianerve damageslowhealing woundsfoot problemslimb amputationseye problems and blindness, or diabetic retinopathydental diseasebladder problemssexual dysfunctionhaving any type of diabetes can also put you at greater risk for complications from covid19, the respiratory disease caused by the novel coronavirus?",
      "What can you tell me about can i reverse my diabetes??",
      "What can you tell me about an anticd3 antibody, teplizumab, in relatives at risk for type 1 diabetes?",
      "What can you tell me about what are the chances that my child will develop type 1 as well?a while there is a genetic component to type 1 diabetes, environmental factors play a role as well?",
      "What can you tell me about 100125 is generally considered prediabetes, 126 and greater with 2 tests is a diagnosis of diabetes?",
      "What can you tell me about i suggest you at least pose this question to your physician.q can the low blood sugar that i experience from time to time be a sign that i could be heading down the road to diabetes??",
      "What can you tell me about prospective virome analyses in young children at increased genetic risk for type 1 diabetes?",
      "What can you tell me about 2017 national standards for diabetes selfmanagement education and support?",
      "What can you tell me about seuring t, archangelidi o and suhrcke m. the economic costs of type 2 diabetes a global systematic review.pharmacoeconomics 2015 33 811831?",
      "What can you tell me about glycemic control and use of a1c in pri mary care patients with type 2 diabetes mellitus?",
      "What can you tell me about 1 for instance, the risk of type 1 diabetes is increased if you have certain variants of genes in the human leukocyte antigen hla complex?",
      "What can you tell me about i suggest you request a fasting glucose test for starters.q if i have some of the risk factors for diabetes, how often should i be tested to find out if i do have it or not??",
      "What can you tell me about a accepting that you have diabetes is largely an act of cognitiona realignment of what you view as real and vital to your existence and how it can impact your life?",
      "What can you tell me about we have advances in the clinic, but not yet an approved therapy that cures type 1 diabetes?",
      "What can you tell me about nutrition research?",
      "What can you tell me about left unchecked over time, it is possible for hypoglycemia to advance into hyperglycemia, and then on to diabetes.q why do i get extremely tired and fall asleep after eating a meal??",
      "Can people with diabetes eat potatoes,ugali, rice, or pasta?",
      "What can you tell me about learn as much as you can.q can eating before a gestational diabetes glucose test cause the results to be inaccurate??",
      "What can you tell me about can j diabetes 2019 2671 399405?",
      "Is it appropriate to believe that following a keto or very low carbohydrate diet helps improve  blood sugar and decreases or eliminates their need for medication or insulin in type 2 diabetes?",
      "What can you tell me about there is no cure at this time, only treatments to help you manage the disease.resources we trustmayo clinic diabetes management how lifestyle, daily routine affect blood sugarcleveland clinic type 1 vs?",
      "What can you tell me about were here to give you the facts about nutrition and diabetes, and to debunk the myths that may have you questioning your food choices?",
      "What can you tell me about the interdiscip linary team in type 2 diabetes management challenges and best practice solutions from realworld scenarios?",
      "What can you tell me about spouses, social networks and other upstream determin ants of type 2 diabetes mellitus?",
      "Is it okay to use honey if i have diabetes?",
      "What can you tell me about one drop is all that is needed.q is it ok for my 14 year old daughter with type 1 diabetes to get her belly button pierced or a small tattoo??",
      "What can you tell me about nutrition  diabetes myths, facts  answers to your questions skip to content back to news  updates share share on twittershare on facebookshare on linkedin nutrition nutrition  diabetes myths, facts  answers to your questions written by melissa herrmann dierks , rdn, ldn, cdces there are many diabetes myths surrounding nutrition, but healthy eating looks different for everyone and will depend on various factors like lifestyle, food preference, and medication?",
      "What can you tell me about verbosky n, beckey c and lutfi n. implementation and evaluation of diabetes management via clinical video tele health?",
      "What can you tell me about although nutrition research can evolve over time, medical professionals like registered dietitian nutritionists rdns have training in medical nutrition therapy, stay up to date on the latest research, and can provide specific dietary recommendations when managing diseases like diabetes?"
    ],
    "responses": [
      "Diabetes myths can make nutrition and diabetes management confusing.",
      "Collective empowerment strategies for patients with diabetes mellitus A systematic review and metaanalysis.",
      "The closer you get to more normal weight, the better your chances for better control with less medication.Q Why are people with diabetes supposed to be so careful about treating cuts and other injuries?A A person who has poorly controlled diabetes may find it takes longer to stop the bleeding or to heal the cut.",
      "Telehealth technologies Changing the way we deliver efficacious and costeffective diabetes selfmanagement education.J Health Care Poor Underserved 2014 25 18531897.",
      "He does need to take this seriously, see his physician assuming he has one, and follow with a diabetes eatinglifestyle plan.",
      "A.",
      "11Autoantibody TestsYour doctor may order a diabetes autoantibody panel to detect autoantibodies that attack insulin or cells in the pancreas related to its production, as well as certain enzymes.",
      "We use only trustworthy sources, including peerreviewed studies, boardcertified medical experts, patients with lived experience, and information from top institutions.ResourcesType 1 Diabetes.",
      "Your doctor is right in that diabetes is very well managed when one is living a healthy lifestyle.",
      "Smoking cessation, weight change, type 2 diabetes, and mortality.",
      "There are those who still produce some insulin, but not at sufficient amounts so to control their blood sugars without taking insulin.",
      "Learn as much as you can.Q Can eating before a gestational diabetes glucose test cause the results to be inaccurate?",
      "Association between the physical activity level and the quality of life ofpatients with type 2 diabetes mellitus.",
      "In some cases, it might even be 10 kilos 22 pounds of weight loss within two weeks.The onset of type 1 diabetes can be difficult to detect in very young children, says Dr. Thomas.",
      "Understanding the physical, social, and emotional experiences of people with uncontrolled type 2 diabetes A qualitative study.",
      "Concept of knowledgebased selfmanagement pathways for the empowerment of diabetes patients.",
      "Type 2 DiabetesType 1 and type 2 diabetes produce the same result blood sugar that is too high.",
      "JDRF.How an RDN Can Help With Diabetes.",
      "Or should I try something like Stevia or Swerve?",
      "QA Nutrition and diabetes In this section, we answer your questions about nutrition and diabetes.",
      "There is no one diet or meal planning method for all people with diabetes.",
      "4Diabetes 101 What Are the Different Types of Diabetes?Next up video playing in 10 secondsSigns and Symptoms of Type 1 DiabetesSymptoms of type 1 diabetes can develop rapidly, especially in young people, says Sanjoy Dutta, PhD, chief scientific officer for the type 1 diabetes research organization JDRF.",
      "Always ask your pharmacist when you arent clear about the best product to buy for diabetes.Q It has been just a few weeks since my diagnosis of type 2 Diabetes and I am a bit freaked out because Ive yet to see anybody mention their A1c being anywhere in the same ball park as mine, which is 11.",
      "There is no cure at this time, only treatments to help you manage the disease.Resources We TrustMayo Clinic Diabetes Management How Lifestyle, Daily Routine Affect Blood SugarCleveland Clinic Type 1 vs.",
      "American Diabetes Association.",
      "Top Common Questions About Diabetes  Special Diets Diabetes Top Common Questions About Diabetes Whether you want to know the recommended blood sugar numbers or need advice on how to stay motivated, our experts have taken on the 20 most commonly asked diabetes questions so you have the answers you need to successfully manage your diabetes.",
      "Diabetes Educ 2019 45 3449.",
      "A cautionary note to people with type 1 diabetes Significant alcohol intake can cause hypoglycemia a number of hours later, so regularly check blood sugar levels when you drink.",
      "Q Can I get rid of diabetes?",
      "Diabetes Educ 2009 35 641651.",
      "There are those with type 2 diabetes who do require insulin to have any semblance of good levels, but can survive without insulin for some period of time, but with high levels.",
      "A Diabetes left unchecked may be involved in a foot infection, which can certainly cause an odor.",
      "American Diabetes Association.Will I Pass on Type 1 Diabetes to My Baby?",
      "17The national standards for diabetes selfmanagement education and support deﬁne diabetesselfmanagement education as a collaborative andongoing process intended to facilitate the developmentof knowledge, skills and abilities that are required for successful selfmanagement of diabetes.",
      "22,23 Education and support for selfmanagement are fundamental when caring for people with a chronic disease like diabetes.",
      "While the patient still needs to be very involved with his or her own diabetes management, these devices offer a helping hand.Other Type 1 Diabetes TreatmentsLesscommon type 1 diabetes treatments includeArtificial Pancreas An increasingly common treatment, this cuttingedge device combines an insulin pump, a CGM, and a dosing algorithm, says Dutta.",
      "6Coxsackieviruses have been studied as possible triggers for type 1 diabetes, and prolonged viral infection may increase a childs risk for developing the disease.",
      "Diabetes Care 2019 42 13331339.",
      "26,27Type 1 Diabetes ComplicationsHaving prolonged high blood sugar can lead to a host of health problems.",
      "29Managing Type 1 Diabetes Diet and ExerciseThere is no onesizefitsall diet or exercise plan for people with type 1 diabetes.",
      "While we all wish it would simply go away, this isnt possibleyet, says David Marrero, Ph.D., who has diabetes and is the director of the Diabetes Translational Research Center at the Indiana University School of Medicine.",
      "Diabetes technologies can be used to empower people with DM and improve their selfcare.",
      "Diabetes Care 2017 40 S33S43.",
      "The big if is whether your pancreas still makes enough insulin to get your glucose down, says Dan Kent, Pharm.D., CDE, a specialty clinical pharmacist with Group Health in Seattle and member of the American Association of Diabetes Educators Board of Directors.",
      "What to Know About Alcohol and Diabetes What About the Glycemic Index?",
      "This will also help your blood sugar numbers come down.Q What is Brittle Diabetes?A Brittle is a term used when one has had diabetes for a long time, and in spite of a solid focus on maintaining a healthy lifestyle and good medication management, it becomes harder to control blood sugars.",
      "A If you have type 2 diabetes and were put on insulin, its likely you need it to bring your blood sugar down farther than pills could.",
      "The most important factor is that he wants to take steps to sleep better and overall maintain a better quality of life.Q I read that with type 2 diabetes, the production of insulin goes down with age.",
      "Q My husband has type 2 diabetes and is a truck driver.",
      "There is no ideal percentage of calories from carbohydrate, protein, and fat that applies to all people with diabetes.",
      "Dutta says this can happen to anyone with type 1 diabetes at any age, but if a person develops the disease in their middle or later years, the progression is typically more gradual, and they are therefore more likely to already be under a doctors care for high blood sugar.Causes and Risk Factors of Type 1 DiabetesIts unknown exactly what causes type 1 diabetes, but experts think it could be a combination of genetic and environmental factors.",
      "National Institute of Diabetes and Digestive and Kidney Diseases.Wortham JM, Lee JT, Althomsons S, et al.",
      "If you are experiencing any symptoms such as weakness, frequent urination, increased hunger or thirst, or frequent infections, then get a fasting test now.Q Is it possible to stop being diabetic?A Once you have diabetes, you will always have it, but you can manage it to the point that it appears as if you dont have it.",
      "How does this mesh if at all with lowcarb diets?",
      "Eventually, however, it can no longer make enough insulin to handle spikes in glucose levels, such as routine rises in blood sugar after a meal.Type 2 diabetes accounts for 90 to 95 percent of all diagnosed cases of diabetes.",
      "Type 1 diabetes often comes on fast and strong, with rapid weight loss, thirst, frequent urination, then stabilizes for a period until the cells stop insulin production.",
      "Marreros advice Accept that diabetes will, for the rest of your life, be there.",
      "Is there a chance that a blood test is wrong?A Type 1 diabetes means that without taking insulin, you cannot live.",
      "A yearly visit to a podiatrist is recommended for persons with diabetes.",
      "Diabetes Metab 2016 42 424432.",
      "Carpenter R, DiChiacchio T and Barker K. Interventions for selfmanagement of type 2 diabetes An integrativereview.",
      "Weigh and balance your decision after some detective work.Q What is the best way to test for type 1 diabetes?",
      "Is honey ok to use if I have diabetes, and in what proportion?",
      "100125 is generally considered prediabetes, 126 and greater with 2 tests is a diagnosis of diabetes.",
      "25Prevention of Type 1 DiabetesDoctors arent aware of a way to prevent type 1 diabetes, but researchers have made progress and are continuing to explore ways to do so or at least slow its progression.",
      "I hope that this person is willing to do what is suggested to get glucoses into a more normal range.Q I was recently diagnosed with type 2 diabetes and now I have my first bout of coldbronchitis since my diagnosis.",
      "But the recommended amount of carbs for most people with diabetes in general is 45 to 65 percent of total daily calories.",
      "A good plan right now is to align yourself with someone who understands healthy eating for diabetes, and become as active as you can.Q Will losing a large amount of weight help me to avoid the diabetes that runs in my family?",
      "Estimating Life Years Lost to Diabetes Outcomes From Analysis of National Diabetes Audit and Office of National Statistics Data.",
      "Is this related to his diabetes?A If his glucose levels have been elevated, he could be breaking down fat for fuel at a rapid rate.",
      "I suggest you request a fasting glucose test for starters.Q If I have some of the risk factors for diabetes, how often should I be tested to find out if I do have it or not?",
      "Melissa has held various sales and marketing positions for leading companies in the diabetes space including insulin pump, blood glucose monitor, and diabetes supply distribution companies.",
      "In the correct serving size, all fruits can be included in a meal or snack when you have diabetes.",
      "There are certain genes called HLA markers associated with diabetes risk which can be identified at birth.",
      "I suggest you at least pose this question to your physician.Q Can the low blood sugar that I experience from time to time be a sign that I could be heading down the road to diabetes?",
      "Many people have had blood sugars over 100 but under 126 for years  known as prediabetes.",
      "What is a good diet to follow for a person with diabetes who has a very active lifestyle?",
      "Type 2 Diabetes Whats the Difference?American Diabetes Association Understanding Type 1 DiabetesCenters for Disease Control and Prevention About Type 1 DiabetesJohns Hopkins Medicine Type 1 DiabetesEditorial Sources and FactCheckingEveryday Health follows strict sourcing guidelines to ensure the accuracy of its content, outlined in our editorial policy.",
      "The role of health literacy in diabetes knowledge, selfcare, and gly cemic control A metaanalysis.",
      "If you maintain good levels that have been established with your physician, then healing times should be similar to anyone else who is basically healthy.Q Can diabetes cause a persons feet to have a bad odor?",
      "Type 2 diabetes is much more common than type 1.Q Is it normal for someone to go from healthy to insulin diabetic very quickly?",
      "The association between selfmanagement barriers and selfefficacy inChinese patients with type 2 diabetes The mediatingrole of appraisal.",
      "Can I Reverse My Diabetes?",
      "Do the math 25 million people have diabetes there are not nearly enough endocrinologists.",
      "12Other Diagnostic Tests The following may also be ordered to diagnose type 1 diabetes 12Cpeptide test measures a byproduct of insulin production and can show how much insulin your body is making, paired with a glucose value.Insulin assay test detects the levels of insulin in your blood, but is less commonly used and more variable than a Cpeptide test.Dutta recommends seeing an endocrinologist for treatment if youre diagnosed with type 1 diabetes.",
      "Its an essential monitoring supply that many people dont know about or use, says Janine Freeman, RDN, CDE, a member of the American Association of Diabetes Educators Board of Directors.",
      "2019 ESC guide lines on diabetes, prediabetes, and cardiovascular diseasesdeveloped in collaboration with the EASD.",
      "The next steps are uncovering if the high blood sugar is due to the pancreas having lost the ability to make adequate insulin, and testing for higherthannormal levels of the antibodies that are often identified in type 1 diabetes.Blood Glucose TestsYour healthcare provider may order the following tests to diagnose type 1 diabetes.Random plasma glucose test, which checks if your blood sugar is too high and doesnt require fasting before your blood sample is drawn.",
      "National Institute of Diabetes and Digestive and Kidney Diseases.",
      "They include 28Heart diseaseStrokeKidney diseaseLow blood sugar, or hypoglycemiaNerve damageSlowhealing woundsFoot problemsLimb amputationsEye problems and blindness, or diabetic retinopathyDental diseaseBladder problemsSexual dysfunctionHaving any type of diabetes can also put you at greater risk for complications from COVID19, the respiratory disease caused by the novel coronavirus.",
      "15Duration of Type 1 DiabetesType 1 diabetes is a lifelong illness that requires careful, daily management of blood sugar levels.",
      "The average yearly cost spent on insulin by people with type 1 diabetes was 5,705 in 2016.",
      "Here are some more facts and figures on type 1 diabetesType 1 diabetes affects at least 1.4 million adults ages 20 years or older  or 5.2 percent of all adults who have been diagnosed with diabetes.",
      "2018.National Diabetes Statistics Report 2020 Estimates of Diabetes and Its Burden in the United States PDF.",
      "Medtronics MiniMed 670G and 770G hybrid closedloop systems, and Tandem Diabetes Cares closedloop ControlIQ are FDAapproved artificial pancreases, he says.Jet Injection Instead of a needle, an injector with an insulin cartridge delivers insulin beneath the skin via a jet of air.",
      "7Other possible risk factors for type 1 diabetes includeBeing male.",
      "They also monitor their blood glucose throughout the day, using a meter or continuous glucose monitor, to ensure that they are getting the correct doses of insulin.Can type 1 diabetes go away?No, unfortunately, it cannot.",
      "Prediabetes is generally 100125, but you will see different ranges for what is considered normal with some thinking that 80 is an ideal fasting level.",
      "Empowerment of patients with type 2 diabetesCurrent perspectives.",
      "A Your risk for hypoglycemia depends on the category of blood glucoselowering medications you take, not your type of diabetes.",
      "Glycemic control and use of A1c in pri mary care patients with type 2 diabetes mellitus.",
      "July 15, 2018.RecentOnset Type 1 Diabetes Trial Evaluating Efficacy and Safety of Teplizumab PROTECT.",
      "37Type 1 diabetes treatment can be very expensive.",
      "JDRF.Diabetes Tests and Diagnosis.",
      "35Each year there are an estimated 64,000 new cases of type 1 diabetes in people under age 64 in the United States 27,000 youths and 37,000 adults.",
      "Q Can I get rid of type 2 diabetes if I stop eating carbs andor lose a lot of weight?",
      "People with diabetes should avoid certain fruits.",
      "Seuring T, Archangelidi O and Suhrcke M. The economic costs of type 2 diabetes A global systematic review.Pharmacoeconomics 2015 33 811831.",
      "The benefits of yoga practice compared to physical exercise inthe management of type 2 diabetes mellitus A systematic review and metaanalysis.",
      "We asked our diabetes experts to answer 20 of your mostasked queries.",
      "7880It is impressive that smoking is higher in people with chronic diseases, such as DM,even after the diagnosis.",
      "Curr Opin Endocrinol Diabetes Obes 2013 20 389395.",
      "Weight regain, aging, and the natural progression of type 2 diabetes can bring it back.",
      "A great resource to look up fruit portion sizes is Choose Your Foods Food Lists for Diabetes from the ADA.",
      "Unless lifestyle changes are made towards better eating habits and activity, prediabetes will usually blossom into diabetes.Q If a 13 year old is diagnosed with diabetes, is it always type 1 and necessary to be on insulin or can it be controlled by diet?",
      "You can control diabetes by avoiding sugar.",
      "14How well you manage type 1 diabetes can affect your life expectancy.In another study, also published in 2015, researchers found that people with type 1 diabetes who underwent intensive treatment for 6.5 years experienced a modestly reduced risk of complications and a lower overall risk of early death.",
      "Diabetes Care.",
      "The interdiscip linary team in type 2 diabetes management Challenges and best practice solutions from realworld scenarios.",
      "Im not saying that a general practitioner will not be helpful, but a primary care physician doesnt have the specialty knowledge to deal with type 1 diabetes, which is a very different disease from type 2 diabetes.Prognosis of Type 1 DiabetesThe average person with a type 1 diabetes diagnosis who makes it to age 43 has a life expectancy that is nearly eight years shorter than someone the same age without that diagnosis, according to a study published in 2020.",
      "Update to a position statement of the American Diabetes Association and the European Association for the Study of Diabetes.",
      "Effectiveness of groupbased selfmanagement education for individualswith Type 2 diabetes A systematic review with meta analyses and metaregression.",
      "What Is Type 1 Diabetes?",
      "I have not been diagnosed with type 1 or 2 Are there any other tests that could help diagnose the type of diabetes I have?A If you were truly type 1, you would require insulin for survival.",
      "9Health profes sionals HPs should tailor their patient selfcare sup port based on the degree of personal responsibility the patient is willing to assume towards their diabetes selfcare management.",
      "But more research is needed, and type 1 diabetes isnt preventable at this time.Can you get type 1 diabetes at any age?Yes.",
      "UCSF Diabetes Education Online.Dietary Guidelines for Americans 20152020 Eighth Edition PDF.",
      "Following a healthy lifestyle and eating whole foods is most important with or without medication.Q How can I help my young adult son with type 1 diabetes get a good night sleep?",
      "This can definitely interfere with metabolism and good blood sugar control.Q What impact would my husbands diabetes have on our future child if we decide to have a baby?A It is not a given that you would give birth to a child with diabetes though the genes may be present.",
      "Most of the commonly used blood glucoselowering medications for type 2 diabetes dont cause hypoglycemia.",
      "Were here to give you the facts about nutrition and diabetes, and to debunk the myths that may have you questioning your food choices.",
      "Hopes books include Diabetes Meal Planning Made Easy and Eat Out Eat WellThe Guide to Eating Healthy in Any Restaurant, and she has also written a nutrition QA column for The Washington Post.",
      "A Yes Research shows that the earlier your diabetes is diagnosed and the sooner you start to aggressively get your blood sugar, blood pressure, and cholesterol into target ranges, the healthier you can be over the years.",
      "A Diabetes in and of itself does not generally cause you to retain weight.",
      "UCSF Diabetes Education Online.Insulin Basics.",
      "Empowerment assessment and influential factors among patients with type 2 diabetes.",
      "Although nutrition research can evolve over time, medical professionals like Registered Dietitian Nutritionists RDNs have training in medical nutrition therapy, stay up to date on the latest research, and can provide specific dietary recommendations when managing diseases like diabetes.",
      "Research suggests that genes account for less than half the risk for developing type 1 diabetes.",
      "However, its important to remember that people with diabetes, just like anyone else, want to eat a balanced diet to keep their body healthy and prevent other diseases, such as heart disease.",
      "10How Is Type 1 Diabetes Diagnosed?Testing for the diagnosis of type 1 diabetes first involves testing for abnormally high blood sugar, says Thomas.",
      "Questions and Answers about Diabetes  Diabetes Action Research and Education Foundation 0 General information Back to QA General questions about diabetes that have been answered by a Diabetes Educator.",
      "A Taking care of diabetes and getting through your daily todo list along with your other responsibilities is demanding.",
      "Q Does a diagnosis of type 2 diabetes mean I will have to go on insulin?",
      "36The agency also reports that at least 187,000 youths under age 20 have type 1 diabetes.",
      "JDRF.Biniek JF, Johnson W. Spending on Individuals With Type 1 Diabetes and the Role of Rapidly Increasing Insulin Prices PDF.",
      "This applies to both type 1 and type 2 diabetes.Q Does fasting make diabetes symptoms worse?",
      "For general guidelines on the portions of carbohydrate, protein, and fat to aim for in a typical meal, view our article on meal planning for diabetes.",
      "1The International Diabetes Federation IDF estimatedthere were 451 m people with DM worldwide in 2017and that number will increase to 693 m by 2045.",
      "Eat foods like bread, crackers, pretzels, dry cereal, 100 percent fruit juice, or sports drink with calories, says Gary Scheiner, CDE, an exercise physiologist and owner of Integrated Diabetes Services near Philadelphia.",
      "Q How can I learn to accept my diabetes?",
      "Prospective Virome Analyses in Young Children at Increased Genetic Risk for Type 1 Diabetes.",
      "Verbosky N, Beckey C and Lutfi N. Implementation and evaluation of diabetes management via clinical video tele health.",
      "Because the disease is most often diagnosed in children, teens, and young adults, it was formerly called juvenile diabetes.",
      "Q I was recently diagnosed with type 2 diabetes.",
      "Effectiveness of individual strategies for the empowerment of patients with diabetes mellitus A systematic review with metaanalysis.",
      "The pain may stop when you sit because your muscles then require less blood flow, says Marjorie Cypress, Ph.D., CNP, CDE, a nurse practitioner in Albuquerque and president of Health Care and Education for the American Diabetes Association.",
      "Special Diets Diabetes Top Common Questions About Diabetes Whether you want to know the recommended blood sugar numbers or need advice on how to stay motivated, our experts have taken on the 20 most commonly asked diabetes questions so you have the answers you need to successfully manage your diabetes.",
      "Diabetes selfmanagement educationand nutritional counselling are integral parts of anytherapeutic programme throughout the disease course.This will ensure that the patient has access to information on methods to safely monitor and control bloodglucose levels.",
      "34,38,52 DSME should be customised, meet the persons needs and take into account personal characteristics, such as medical history, age, health beliefs and attitudes, diabetes knowledge, physical limitations, family supportand ﬁnancial status.",
      "Prim Care Diabetes 2017 11 201211.Lambrinou et al.",
      "Meeting with a licensed healthcare professional, including a registered dietitian nutritionist, can help to individualize a diabetes nutrition plan based on your age, health and weight goals, metabolic profile, type of medications used, and more.",
      "For more information, check out the ADAs guidelines for how different dietary patterns affect diabetes and overall health.",
      "Factors associated with glycaemic control in patients with diabetes mellitus A systematic literature review.",
      "A Once you are diagnosed with type 1 or type 2 diabetes, you have it for the rest of your life.",
      "When it comes to diabetes, carbohydrate is looked at per meal and snack, not per day.",
      "December 2015.Diabetes Diet, Eating, and Physical Activity.",
      "You may want to discuss this with your physician.Q I am new to diabetes and am having trouble sticking myself for testing my blood sugar.A The first step in pricking your finger is to wash your hands with soap and water when at home.",
      "Developing healthy eatinglifestyle habits now is most important.Q How do I find out whether I am type 1 or type 2 diabetes?",
      "While their journey will be different from the experience of those who dont have type 1 diabetes, they can still live a fulfilling, successful life, and they may find that their unique experience gives them the ability to tap into an inner power they didnt realize they had.Dutta strikes a similarly optimistic tone.",
      "With insulinrequiring diabetes, this can be an even greater challenge to maintain stable blood sugars, but is very achievable with the right monitoring and support.",
      "1How Type 1 Diabetes Raises Blood SugarIn the normal digestive process, your body breaks down much of the food you eat into glucose, a simple sugar thats stored in your body and used for energy.",
      "Aside from journalism, her passions include running, fitness, and healthy living.See full bioSee Our Editorial PolicyMeet Our Health Expert NetworkSign up for our Diabetes NewsletterEnter your emailSubscribeBy subscribing you agree to the Terms of Use and Privacy Policy.",
      "33ExercisePhysical activity is another important aspect of diabetes management.",
      "There is no one size fits all diet for people with diabetes.",
      "Pathways of empower ment perceptions, health literacy, selfefficacy, and selfcare behaviors to glycemic control in patients with type 2 diabetes mellitus.",
      "Left unchecked over time, it is possible for hypoglycemia to advance into hyperglycemia, and then on to diabetes.Q Why do I get extremely tired and fall asleep after eating a meal?",
      "Aerobic fitness and adherence to guidelinerecommended minimum physicalactivity among ambulatory patients with type 2 diabetesmellitus.",
      "This is certainly truer of those on the path to type 1 diabetes.",
      "It can also feel confusing to find accurate resources for meal planning for diabetes with many opinions available online and on social media today.",
      "Exploring how patients understand and assess their diabetes con trol.",
      "Will My Diabetes Ever Go Away?",
      "Symptoms, Causes, Diagnosis, and Treatment Type 1 DiabetesWhat Is Type 1 Diabetes?",
      "The Best and Worst Fruits to Eat If You Have Diabetes7Day Diabetes Diet Dinner Plan Was this page helpful?",
      "November 8, 2017.Rates of New Diagnosed Cases of Type 1 and Type 2 Diabetes Continue to Rise Among Children, Teens.",
      "Research indicates that if type 2 diabetes is treated early and blood sugar is controlled initially and over the years, the pancreas is more likely to produce enough insulin longer.",
      "A Accepting that you have diabetes is largely an act of cognitiona realignment of what you view as real and vital to your existence and how it can impact your life.",
      "Diabetes Care 2015 38 15361543.",
      "Fluctuations in the Incidence of Type 1 Diabetes in the United States From 2001 to 2015 A Longitudinal Study.",
      "2017 National standards for diabetes selfmanagement education and support.",
      "Since carbohydrate is the nutrient in food that has the greatest effect on blood sugar, many people with diabetes tend to focus only on carbohydrate counting.",
      "Yes, honey is okay but in small quantities to avoid a spike in blood sugar levels",
      "In fact, the ADA recommends an individualized approach to nutrition and diabetes.",
      "A Yes, adults with diabetes can drink alcohol and should follow the same guidelines as the general publican average of up to one drink per day for women and up to two drinks per day for men, with no more than three or four drinks in any single day for women and men, respectively.",
      "Lancet Diabetes Endocrinol 2016 4 913921.",
      "If you have prediabetes or were just diagnosed with type 2, losing a lot of weight can put the condition into remission.",
      "How do I know when I should see my doctor vs. let the illness run its course?A When you have diabetes and are ill enough to where your blood sugars go too high andor your illness doesnt come under control in a normal course, you should certainly seek medical attention.",
      "Role of selfcare in management of diabetes mellitus.J Diabetes Metab Disord 2013 12 14.",
      "But they do it in very different ways.As mentioned, type 1 diabetes is an autoimmune disorder that results in the body being able to produce little or no insulin.",
      "Selfmanagement education should be customised and meet the peoples needs taking intoaccount their disease experience, personal characteristics, such as medical history, age, health beliefs andattitudes, diabetes knowledge, health literacy, physicallimitations, family support, ﬁnancial status and sociocultural factors.",
      "This the same caution for any wound, especially on the feet, which is why people with diabetes are encouraged to check feet daily for even a small splinter.",
      "Q Is it true that complications of diabetes can be delayed and even prevented?",
      "9Yet 80 percent of people with type 1 diabetes have no family history of the disease.",
      "Factors influencing selfmanagement in patients withtype 2 diabetes A quantitative systematic review proto col.J Adv Nurs 2014 70 187200.",
      "20Glucose MonitoringAn essential part of managing type 1 diabetes is glucose monitoring.",
      "What are the chances that my child will develop type 1 as well?A While there is a genetic component to type 1 diabetes, environmental factors play a role as well.",
      "But, he adds, continuing advances in glucose monitoring and insulin delivery are making it easier for people to manage life with the disease.Treatment and Medication Options for Type 1 DiabetesThe cornerstone of type 1 diabetes management continues to be insulin therapy, says Thomas.",
      "Research shows moderate alcohol consumption has minimal short or longterm effects on glucose levels in people with type 1 or 2 diabetes, says Marion Franz, RD, CDE, owner of Nutrition Concepts by Franz in Minneapolis.",
      "One drop is all that is needed.Q Is it OK for my 14 year old daughter with type 1 diabetes to get her belly button pierced or a small tattoo?",
      "A reading higher than 126 mgdL points to diabetes.",
      "Type 2 diabetes.",
      "9Having a close family relative who has type 1 diabetes 1In fact, the odds that a man with type 1 diabetes has a child who develops it are 1 in 17.",
      "People with diabetes need to eat a certain amount of carbs every day for energy and essential nutrients.",
      "Studies found it delayed the onset of type 1 diabetes by an average of two years in people who had relatives with the disease.",
      "Be mindful of chlorine which may be irritating.Q Do people with diabetes need to use special toothpaste?",
      "3Type 2 diabetes develops when liver, muscle, and fat cells dont respond properly to insulin and become insulin resistant.",
      "A fasting level 126 or greater taken twice is considered a diagnosis of diabetes.",
      "The constant need to be thinking about diabetes can grow tiresome and frustrating for many young people, says Thomas.",
      "Testing for ketones is also important if you truly have gestational diabetes.",
      "Effect of a nurseled diabetes selfmanagement education program on glycosylated hemoglobin among adults with type 2 diabetes.J Diabetes Res 2018 4930157.",
      "90 of children who develop type 1 diabetes do not have a relative with this disease and it is reported that only 15 of people with type 1 diabetes have a firstdegree relative, such as a parent, with diabetes.",
      "There is no onesizefitsall diet for people with diabetes.",
      "Clin Diabetes Endocrinol 2018 4.",
      "With diabetes, you may find you now respond to illness differently so do not hesitate to talk to your health care team if you have any questions.Q How can I prevent diabetes?",
      "mHealth interventions for diabetes remote monitoring and self management Clinical and compliance issues.",
      "Symptoms, Causes, Diagnosis, and TreatmentBySheryl Huggins SalomonMedically ReviewedbyKacy Church, MDUpdated on February 18, 2023ON THIS PAGEON THIS PAGEType 1 diabetes is an autoimmune disease that leads the body to stop making enough insulin to keep glucose sugar at a healthy, normal level.",
      "Yes, it can feel confusing to find accurate resources for meal planning for diabetes with many opinions available online and on social media today.",
      "Is that always type 2?A Those diagnosed with type 2 diabetes will still produce insulin.",
      "1 For instance, the risk of type 1 diabetes is increased if you have certain variants of genes in the human leukocyte antigen HLA complex.",
      "A No, the diagnosis of a child is not always type 1 diabetes.",
      "5Frequently, a bout of DKA is what leads to a diagnosis of type 1 diabetes, particularly in young people.",
      "A Frequent urination, rapid weight loss, dizziness, and excessive thirst are just some of the symptoms associated with, but not exclusive to diabetes.",
      "Thanks for your feedback Tell us why Other Submit Related Articles The Best Time to Check Blood Glucose After a Meal What You Should Know About Diabetes  the Coronavirus Can People with Diabetes Consume Sugar?",
      "A reading higher than 200 milligrams per deciliter mgdL with symptoms of high blood sugar indicates you have diabetes.",
      "Strand was the first person with diabetes to win The Amazing Race TV show.",
      "An AntiCD3 Antibody, Teplizumab, in Relatives at Risk for Type 1 Diabetes.",
      "Relation of smoking with total mortality and cardiovascular events among patients with diabetes mellitus A metaanalysis and systematic review.",
      "General diabetes nutrition questions Q.",
      "By Hope Warshaw, M.M.Sc., RD Hope Warshaw, M.M.Sc., RD Hope Warshaw is a health educator and corporate consultant specializing in diabetes nutrition.",
      "30DietA registered dietitian nutritionist RDN, and especially one who is also a certified diabetes care and education specialist CDCES, can help you to find the meal plan that is right for you.",
      "Nutrition  Diabetes Myths, Facts  Answers to Your Questions Skip to content Back to News  Updates share Share on TwitterShare on FacebookShare on LinkedIn Nutrition Nutrition  Diabetes Myths, Facts  Answers to Your Questions Written by Melissa Herrmann Dierks , RDN, LDN, CDCES There are many diabetes myths surrounding nutrition, but healthy eating looks different for everyone and will depend on various factors like lifestyle, food preference, and medication.",
      "Consult your healthcare professional HCP or RDN for an individualized meal plan, as there are many factors that contribute to nutrition recommendations for your diabetes care plan.",
      "Its also not healthy, because you wont get essential nutrients, says JoJo Dantone, RD, CDE, a diabetes program coordinator in New Orleans.",
      "6 Diabetes myths about nutrition The many diabetes myths surrounding nutrition can make deciding what to eat confusing.",
      "If your body truly no longer makes insulin, as the case with type 1 diabetes, and you are not injecting insulin, you will die.",
      "Education and support for selfmanagement are fundamental when caring for people with a chronic disease like diabetes mellitus.",
      "Today, diabetes complications dont need to happen.",
      "Nearly 40 percent of COVID19 deaths in the United States during the first few months of the pandemic happened to people who had diabetes.",
      "With childhood obesity so common now, we are seeing type 2 diabetes at much younger ages.",
      "Many people believe that following a keto or very low carbohydrate diet helps improve their blood sugar and decreases or eliminates their need for medication or insulin in type 2 diabetes.",
      "The following information can help you to separate fact from fiction on nutrition and diabetes 6 diabetes myths about nutrition Nutritional recommendations for diabetes QA Nutrition and diabetes The American Diabetes Association ADA notes that eating well is an important tool in your diabetes management plan.",
      "35Research and Statistics How Many People Have Type 1 Diabetes and Who Are They?Type 1 affects people of all ages.",
      "The rela tive importance of physician communication, participatory decision making, and patient understanding indiabetes selfmanagement.",
      "However, a keto diet may not be the best for your heart and kidneys when you have diabetes, and many people are not able to sustain such a limited diet over the long term.",
      "Browse our site to see many more diabetes questions and answers.Q If my father has type 2 diabetes, does that mean that I am more likely to get it also?A You may have the genetic foundation for developing diabetes, but it is not inevitable.",
      "EatingWells Editorial Guidelines Published on September 28, 2018 Close Common Questions About Diabetes Diabetes information is available almost everywhere.",
      "People with type 2 diabetes may or may not ever need to take insulin injections, depending on several factors, including the timing of diagnosis.",
      "A It is possible to have your production of insulin cease over time, but usually this is not the case for type 2 diabetes.",
      "McGowan P, Lynch S and Hensen F. The role and effect iveness of telephone peer coaching for adult patients with type 2 diabetes.",
      "Be most dedicated to yourself now, as 170 fasting would indicate diabetes.",
      "This is more often the case with insulin dependent diabetes.",
      "However, there are some nutrition recommendations for diabetes that most people are advised to follow Eat at least three times a day to keep blood sugar stable.",
      "A keto diet is best for diabetes.",
      "Gestational Diabetes Meal Plan  Diet Guidelines Everything You Need to Know About Sugar Substitutes How to Lower Triglycerides  LDL Cholesterol These Are the Best Foods for Lowering Spiked Blood Sugar Your Guide to Summer Safety for Diabetes Newsletter Sign Up Newsletter Sign Up",
      "Nutritional recommendations for diabetes There is no one meal planning method or diet for diabetes.",
      "The signs of something wrong may be more subtle, such as more wet diapers or heavier diapers, bedwetting, and increased thirst.Diabetic Ketoacidosis DKAAnother symptom of type 1 diabetes can be lifethreatening, and particularly for young people who are less likely to understand what they are going through, says Dutta.",
      "What Are Good Travel Foods for People with Diabetes?",
      "A For most people with diabetes, the American Diabetes Association recommends a fasting or beforemeals blood glucose or blood sugar goal of 70130 mgdl.",
      "December 2019.Diabetes Risk Factors.",
      "A Changing your lifestyle which will ultimately result in body composition changes and weight reduction can certainly keep diabetes in check.",
      "You didnt develop diabetes over night you may have been prediabetic for some time.",
      "Diabetes Meal Planning Chart Download this free handy guide to meal planning and carbohydrate counting to keep on your fridge, phone, or purse.",
      "Effects of tele phonebased peer support in patients with type 2 diabetes mellitus receiving integrated care A randomized clinicaltrial.",
      "Just because there is diabetes in your family, it doesnt mean you have to get it if you start now with lifestyle changes.",
      "Take charge of your lifestyle habits and get all the education you can on managing this disease.Q How does diabetes affect your mood and thinking process?A With or without diabetes, when blood sugars are not in balance, fatigue, dizziness, fuzzy thinking, mood swings, and other symptoms may result.",
      "Research is ongoing and very active in the field of diabetes and genetic markers so updated information could be available in the near future.Q I am not diabetic according to medical tests.",
      "Stay well hydrated.",
      "I had a morphine pump that leaked into my bloodstream and all through my body when it wasnt supposed to for about a month and, as a result, I gained in excess of 50 pounds.A The stress that caused you to be placed on the pump in the first place, plus the probability that you have a genetic disposition to diabetes, triggered further by weight gain, is now surfacing as diabetes.",
      "Q My 12 year old daughter has been diagnosed with prediabetes from a blood test.",
      "National standards for diabetes selfmanagement education and support.Diabetes Care 2012 38 23932401.",
      "A Preplanning and having healthy snacks at the ready are keys to helping you eat healthy on the road, says Lisa Brown, RD, CDE, of BrownFox Solutions in Minneapolis and chair of the Academy of Nutrition and Dietetics Diabetes Care and Education practice group.",
      "13That is slightly less than the life expectancy reported in a 2015 Scottish study that found men with type 1 diabetes at age 20 had a life expectancy about 11 years shorter than men who didnt have the disease.",
      "Strategiessuch as the above can be useful to enhance personscommitment to diabetes selfmanagement.",
      "Development of a patient decision aid for type 2 diabetes mellitus for patients not achieving glycemic control on metformin alone.",
      "Can People with Diabetes Eat Bread?",
      "Complications of diabetes, such as nerve damage or the risk of low blood sugar, may require adjustments in how you exercise.",
      "Use of commonly available technologies for diabetes information and self management among adolescents with type 1 diabetes andtheir parents A Webbased survey study.",
      "People with diabetes should not eat potatoes, rice, or pasta.",
      "The risk of being diagnosed with type 1 diabetes is approximately 1.5 times higher for males than for females, says Thomas.Having autoantibodies that are associated with higher risk 1Being of European descent although people of any race or ethnicity can develop it.",
      "19BIPOC and Type 1 DiabetesAlthough type 1 diabetes is most prevalent in the United States among white people, Hispanic 4.4 percent, nonHispanic Asian and Pacific Islander 4.0 percent, and Black 2.7 percent children and youths saw the steepest annual percentage increases in cases between 2002 and 2015.",
      "I am 14 and overweight and diabetes runs in my family.A Be very active, and learn as much as you can about healthy eating.",
      "45For persons with diabetes, online discussion groups are found to have a positive impact on patients conﬁdence and their ability to actively make decisions with the healthcare teamabout their condition.",
      "With an active lifestyle, it is important to monitor blood sugar closely  especially for people who take insulin or medication for their diabetes  in order to prevent a low blood sugar.",
      "April 5, 2022.Learn the Genetics of Diabetes.",
      "Prim Care Diabetes 2018 12 97110.",
      "Association of the magnitude ofweight loss and changes in physical fitness with long term cardiovascular disease outcomes in overweight or obese people with type 2 diabetes A posthoc analysisof the Look AHEAD randomised clinical trial.",
      "Q Is diabetes causing me to be tired and sleepy after eating?A Elevated blood sugar levels send a signal to the brain to release serotonin, a hormone that is both calming and sleep inducing.",
      "Diabetes becomes an integral part of a persons life.",
      "2. International Diabetes Federation.",
      "It is better late than never its time to find outQ I have type 1 diabetes.",
      "Spouses, social networks and other upstream determin ants of type 2 diabetes mellitus.",
      "in 2015, social media use has shown added valuefor selfmanagement in chronic conditions, includingdiabetes.",
      "August 15, 2019.Preventing Diabetes Problems.",
      "Muscle atrophy in patients with type 2 diabetes mellitusRoles of inflammatory pathways, physical activity and exercise.",
      "Having a disease like diabetes does provide greater challenges for stable health and moods, but does not negate the ability to attain and maintain them.Q Is it possible that weight gain and morphine use caused me to develop type 2 diabetes?",
      "Prediabetes is just now being more aggressively focused upon for diabetes prevention.",
      "57 The national standards for diabetes selfmanagement education and support de Ene diabetes selfmanagement education DSME as, a collaborative and ongoing pro cess intended to facilitate the development of knowledge, skills, and abilities that are required for successfulselfmanagement of diabetes p. 1.",
      "Related ArticlesSee All in Type 1 DiabetesdiabetesFDA Says Shortages of GLP1 Drugs Mounjaro and Zepbound Are OverPublished onDecember 23, 2024type 1 diabetesWhat Is the Honeymoon Phase in Type 1 Diabetes?Medically ReviewedbyElise M. Brett, MDDecember 17, 2024type 2 diabetesType 2 Diabetes A Start Guide for ExerciseMedically ReviewedbySandy Bassin, MDDecember 13, 2024type 2 diabetesIs Prediabetes a Useful Diagnosis?",
      "100 is prediabetes.",
      "But 58 percent of new cases of type 1 diabetes in the United States each year are diagnosed in adults.How is type 1 diabetes treated?People with the disease are given insulin therapy.",
      "This is referred to as type 1.5 diabetes.",
      "She balances both outpatient and inpatient responsibilities, seeing a variety of patients with diabetes, as well as thyroid and pituitary disorders.",
      "People with diabetes should avoid fruits with high sugar percentage or consume them in small amounts.",
      "Digital health technol ogy and mobile devices for the management of diabetes mellitus State of the art.",
      "But type 1 diabetes is an autoimmune disease in which the body attacks and destroys cells that make insulin, while with type 2 diabetes, the body stops using insulin effectively over time.How do you get type 1 diabetes?The cause of type 1 diabetes isnt really known, but experts are looking into a combination of genes and environmental triggers, such as viruses.",
      "With type 2, some people take insulin to help get glucose levels under control, but by adopting a more healthy lifestyle with dietexercise, levels can begin to come under better control and insulinmedication may not required.Q I read that people with diabetes should not use heating pads.",
      "Diabetes self management education for adults with type 2 diabetes mellitus A systematic review of the effect on glycemic control.",
      "She completed her fellowship in endocrinology, diabetes, and metabolism in 2017 at Stanford University in California.She loves running, dancing, and watching her sons play sports.See full bioSheryl Huggins SalomonAuthorSheryl Huggins Salomon has spent her career equipping people with information to help improve their wellbeing and prospects in life.",
      "Determinants of hospitalization in Chinese patients with type 2 diabetes receiving a peer support intervention and JADE integrated care The PEARL randomised controlled trial.",
      "I know I am at high risk of getting diabetes but when I diet, it doesnt make a difference and I cant lose weight.",
      "The meal plan recommendations for people with type 1 diabetes are individualized, and yes, some people choose a lowcarb diet or even a very lowcarb diet.",
      "RacialEthnic Minority Youth With RecentOnset Type 1 Diabetes Have Poor Prognostic Factors.",
      "March 25, 2021.Type 2 Diabetes.",
      "Intensive patient edu cation improves glycaemic control in diabetes compared to conventional education A randomised controlled trial in a Nigerian tertiary care hospital.",
      "Revisit this with your health care team and ask them what their blood sugar criteria is.Q How does smoking affect diabetes?A Diabetes is considered a cardiovascular disease and smoking negatively affects the cardiovascular system.",
      "Prim Care Diabetes 2015 9 385391.",
      "An A1C of 6.5 or higher indicates diabetes.",
      "Effects of aer obic and resistance training on hemoglobin A 1c levels inpatients with type 2 diabetes A randomized controlled trial.",
      "Management of hyperglycaemia in type 2 diabetes, 2015 A patientcentred approach.",
      "Related Articles Tips 10 Ways to Control Your Diabetes Tips  Resources Read Article Nutrition, Tips Meal Planning  Exercise Tips for Insulin Resistance Read Article Diabetes, Fitness, Health, Lifestyle, Tips 12 Helpful Health Apps for Diabetes Glucose Tracking, Nutrition  More Read Article Were looking for talented, passionate people to join our team.",
      "A fasting blood sugar of 126 repeated twice is a diagnosis of diabetes.",
      "July 2022.Diabetes Autoantibody Panel.",
      "There are no fruits that people with diabetes should avoid.",
      "Impact of infor mation technologybased interventions for type 2 diabetes mellitus on glycemic control A systematic reviewand metaanalysis.",
      "Diabetes atlaseighth edition 2017 , httpswww.diabetesatlas.org 2017, accessed 11 May 2019.",
      "How Do I Accept Diabetes?",
      "Diabetes health platforms have built a diabetes digital ecosystem by incorporating large amounts of realworld data.",
      "How to Become an Expert Meal Planner When You Have Diabetes How to Manage Eye Health When You Have Diabetes 4 Best Burger King Breakfast Items to Support Your Blood Sugar, According to a Dietitian 25 Simple DiabetesFriendly Recipes to Make with Pantry Staples Can You Eat Dried Fruit If You Have Diabetes?",
      "Share on TwitterShare on FacebookShare on LinkedIn Written by Melissa Herrmann Dierks , RDN, LDN, CDCES Melissa Herrmann Dierks RDN, LDN, CDCES is a Registered Dietitian Nutritionist, Certified Diabetes Care and Education Specialist, and Licensed Dietitian Nutritionist in Huntersville, NC with over twentyfive years of professional experience in the field of nutrition and diabetes education.",
      "A Weight loss is vital, particularly just after a diagnosis of type 2 or prediabetes.",
      "Cypress suggests lowering your risks for PAD with the same advice you follow to stay healthy with diabetes.",
      "February 1, 2022.Type 1 Diabetes.",
      "Diabetes mel litus statistics on prevalence and mortality Facts and fallacies.",
      "J Diabetes Metab Disord 2013 12 6.",
      "Diabetes, Metab Syndr Obes Targets Ther 2019 12 13111321.",
      "Top Common Questions About Diabetes  Found Hoka, Nike, and more of our favorite walking shoes, up to 50 off.",
      "Quantifying the association between physical activity and cardiovas cular disease and diabetes A systematic review and meta analysis.",
      "A very active person who takes insulin or medication for their diabetes will want to make sure not to skip meals and plan to eat on time.",
      "American Diabetes Association.Insulin Types and Usage.",
      "2With type 1 diabetes, the bodys immune system attacks and destroys the pancreass insulinproducing beta cells.",
      "Diabetes Metab Syndr Clin Res Rev2018 12 795805.",
      "Communitybased peerled diabetes selfmanagement A randomized trial.",
      "There is likely a genetic component that places patients at risk, with some environmental influences as well.People who have type 1 diabetes must replace insulin every day through injections or infusion and monitor their blood glucose throughout the day.",
      "What are the nutritional recommendations for individuals adults with type 1 diabetes in terms of daily carbohydrate intake?",
      "Glucose doesnt enter the cells as efficiently as before and instead builds up in the bloodstream.In type 2 diabetes, the pancreas responds to these increased blood glucose levels by producing more insulin.",
      "With perseverance, you can stay in control.Q Can diabetes prevent someone from losing weight?",
      "May 2018.Additional SourcesFDA Approves First Drug That Can Delay Onset of Type 1 Diabetes.",
      "Learn all you can at this time on how to manage diabetes and live with it.",
      "People with diabetes can eat potatoes, rice, or pasta but in small servings to avolid spike in blood sugar.",
      "Once you are shown, then you can practice and more assured of the readings you are getting.Q Does obesity cause type 2 diabetes?A Obesity is not the cause of type 2 diabetes, but is a strong contributor if one is genetically disposed.",
      "The importance of health belief models in determining selfcare behaviour in diabetes.",
      "People with diabetes, just like anyone else, should eat a balanced diet to keep their body healthy and prevent other diseases, such as heart disease.",
      "American Diabetes Association.Type 1 Diabetes.",
      "We know that patients with uncontrolled diabetes and COVID19 infection experience more severe symptoms of COVID19, can have more extensive lung involvement, and die more often, says Thomas.",
      "This produces ketones, which can produce fruity or acidic breath.",
      "39Common Questions  AnswersWhat is the difference between type 1 and type 2 diabetes?Type 1 and type 2 diabetes both result in blood sugar that is too high.",
      "Association Between 7 Years of Intensive Treatment of Type 1 Diabetes and LongTerm Mortality.",
      "Diabetes Care 2016 39 e1e2.",
      "Can J Diabetes 2019 2671 399405.",
      "Most people with type 2 diabetes, especially in the early years, can partner with a primary care provider who takes an active interest in their diabetes, Argento says.",
      "We have advances in the clinic, but not yet an approved therapy that cures type 1 diabetes.",
      "Estimated Life Expectancy in a Scottish Cohort With Type 1 Diabetes, 20082010.",
      "A While diabetes is an endocrine disease and falls under the specialty of an endocrinologist, there are only 3,000 of us in the U.S. who treat diabetes, says Nicholas Argento, M.D., an endocrinologist with Maryland Endocrine near Baltimore who has type 1 diabetes."
    ]
  },

  {
    "tag": "diabetes_diagnosis",
    "patterns": [
      "What is a A1C test?",
      "How is diabetes diagnosed?",
      "What can you tell me about in europe only half of diagnosed patients with diabetes mellitus have good glycaemic control?",
      "What can you tell me about although these are not speciﬁc diabetestechnologies, they can be used for social interactionof people living with diabetes?",
      "What can you tell me about education and selfmanagement for people newly diagnosed with type 2 diabetes a qualitative study of patients views?",
      "What can you tell me about overcoming clinical inertia a randomized clinical trial of a telehealth remote monitoring intervention using paired glucose testing in adults with type 2 diabetes.j med internet res 2015 17 e178?",
      "What can you tell me about diet or diet plus physical activity versus usual care in patientswith newly diagnosed type 2 diabetes the early actid randomised controlled trial?",
      "What can you tell me about development and psychometric testing of a theorybased tool to measure selfcare in diabetes patients the selfcare of diabetesinventory?",
      "How do I find out I'm suffering from diabetes?",
      "What are the various types of diabetes tests?",
      "Do I need to fast before taking my A1C test?",
      "Can I test myself for diabetes?"
    ],
    "responses": [
      "Although these are not speciﬁc diabetestechnologies, they can be used for social interactionof people living with diabetes.",
      "Overcoming clinical inertia A randomized clinical trial of a telehealth remote monitoring intervention using paired glucose testing in adults with type 2 diabetes.J Med Internet Res 2015 17 e178.",
      "Development and psychometric testing of a theorybased tool to measure selfcare in diabetes patients The SelfCare of DiabetesInventory.",
      "Education and selfmanagement for people newly diagnosed with type 2 diabetes A qualitative study of patients views.",
      "In Europe only half of diagnosed patients with diabetes mellitus have good glycaemic control.",
      "Diabetes is diagnosed through fasting blood sugar test, A1C test (measures average blood sugar over 2-3 months), oral glucose tolerance test, and random blood sugar test. Your doctor will determine which tests are appropriate.",
      "Diet or diet plus physical activity versus usual care in patientswith newly diagnosed type 2 diabetes The Early ACTID randomised controlled trial."
    ]
  },
  {
    "tag": "diabetes_treatment",
    "patterns": [
      "What can you tell me about 30 lifestyle modification people with dm are obliged to take important daily decisions concerning their treatment but are often also required to make lifestyle changes with regardsto their dietary patterns and level of physical activityin order to prevent or manage concomitant cvds?",
      "What can you tell me about 11similarly, in the usa only 55.5 of participants achieved good glycaemic con trol.12access to resources and support systems, patients attitude and expected treatment eﬀorts,comorbidities, disease duration and risk of hypoglycaemia are the main factors that are related to inadequate glucose control?",
      "What can you tell me about dose and time dependent association of smoking and its cessation withglycemic control and insulin resistance in male patients with type 2 diabetes mellitus the fukuoka diabetes registry?",
      "What is the permanent treatment for diabetes?",
      "How is diabetes treated?",
      "What can you tell me about the links between insulin resistance, diabetes, and cancer?",
      "What can you tell me about 56lifestyle medicine has emerged as a systematised approach for the management of achronic disease such as diabetes?",
      "What can you tell me about 9 treatment and adaptation of selfcare behaviours inchronic diseases is a slow process, due to the need ofthe people in these conditions to develop knowledge ontheir health condition with the possibilities of promoting healthcare, dealing with the disease and preventingcomplications?",
      "What are the various treatments for diabetes?",
      "Can diabetes be cured?",
      "What can you tell me about 38,43,44applications and smartphone technologies oﬀer technological solutions for telemedicine, socialinteraction, exercise monitoring and speciﬁc diabeteshealth platforms?",
      "What can you tell me about poor medication adher ence in type 2 diabetes recognizing the scope of theproblem and its key contributors?",
      "What can you tell me about 8 selfefficacy and selfcare behaviours successful selfmanagement of dm requires suﬃcientknowledge of the condition and its treatment and theperformance of selfmanagement activities and skills 34 and selfcare behaviours are found to inﬂuence thehba1c levels in patients with dm?",
      "Will I need other medication in addition to insulin?",
      "What can you tell me about the patientprovider collaborative relationship and communication is shown to result ingreater patient satisfaction, adherence to treatmentplans and improved health outcomes?",
      "What can you tell me about 20 sdm allows both provider and patient to be expert,to discuss about diﬀerent treatment options and toconsider options in light of the values, preferencesand context of the patient?",
      "Are there any herbal remedies for diabetes?",
      "What can you tell me about selfmanagement includes meal planning, planned physical activity, blood glucose monitoring, taking diabetes medicinesand managing episodes of illness and of low and highblood glucose?"
    ],
    "responses": [
      "8 Selfefficacy and selfcare behaviours Successful selfmanagement of DM requires suﬃcientknowledge of the condition and its treatment and theperformance of selfmanagement activities and skills 34 and selfcare behaviours are found to inﬂuence theHbA1c levels in patients with DM.",
      "The links between insulin resistance, diabetes, and cancer.",
      "56Lifestyle medicine has emerged as a systematised approach for the management of achronic disease such as diabetes.",
      "11Similarly, in the USA only 55.5 of participants achieved good glycaemic con trol.12Access to resources and support systems, patients attitude and expected treatment eﬀorts,comorbidities, disease duration and risk of hypoglycaemia are the main factors that are related to inadequate glucose control.",
      "The patientprovider collaborative relationship and communication is shown to result ingreater patient satisfaction, adherence to treatmentplans and improved health outcomes.",
      "9 Treatment and adaptation of selfcare behaviours inchronic diseases is a slow process, due to the need ofthe people in these conditions to develop knowledge ontheir health condition with the possibilities of promoting healthcare, dealing with the disease and preventingcomplications.",
      "Selfmanagement includes meal planning, planned physical activity, blood glucose monitoring, taking diabetes medicinesand managing episodes of illness and of low and highblood glucose.",
      "30 Lifestyle modification People with DM are obliged to take important daily decisions concerning their treatment but are often also required to make lifestyle changes with regardsto their dietary patterns and level of physical activityin order to prevent or manage concomitant CVDs.",
      "Treatment options include insulin therapy (especially for Type 1), oral medications, regular blood sugar monitoring, healthy diet, regular exercise, and weight management. Treatment plans are personalized based on diabetes type and severity.",
      "20 SDM allows both provider and patient to be expert,to discuss about diﬀerent treatment options and toconsider options in light of the values, preferencesand context of the patient.",
      "Dose and time dependent association of smoking and its cessation withglycemic control and insulin resistance in male patients with type 2 diabetes mellitus The Fukuoka diabetes registry.",
      "38,43,44Applications and smartphone technologies oﬀer technological solutions for telemedicine, socialinteraction, exercise monitoring and speciﬁc diabeteshealth platforms.",
      "Poor medication adher ence in type 2 diabetes Recognizing the scope of theproblem and its key contributors."
    ]
  },
  {
    "tag": "diabetes_prevention",
    "patterns": [
      "What can you tell me about important variables for the prevention of diabetes mellitus and its complications are selfmanagementof diabetes mellitus and the management of risk factors?",
      "What can you tell me about full research paper lifestyle factors, selfmanagement and patient empowerment in diabetes care ekaterini lambrinou1, tina b hansen2,3and joline wj beulens4,5 abstract although management of diabetes mellitus is improving, inadequately managed cases still exist?",
      "What can I do to prevent diabetes?",
      "What can you tell me about balakumar p, maungu k and jagadeesh g. prevalence and prevention of cardiovascular disease and diabetes mellitus?",
      "What can you tell me about influence of lifestyle on incident cardiovascular disease and mortality in patients with diabetes mellitus?",
      "What can you tell me about keywords lifestyle factors, selfmanagement, patient empowerment, diabetes care, diabetes mellitus received 2 july 2019 accepted 9 october 2019 introduction diabetes mellitus dm is a major public health problem, aﬀecting people of all ages worldwide?",
      "Is there a diet that can help prevent diabetes?",
      "What can you tell me about 38the development of innovative diabetes care management is important inorder to provide continuity to care, improve healthylifestyle and reduce patient risk factors and comorbidities?",
      "What can you tell me about in this review, the role of the three main pillars indiabetes care are identified and discussed patient empowerment, selfmanagement education and lifestyle modification inthe management of people with diabetes mellitus?",
      "What can you tell me about the following keywords diabetesmellitus, cardiovascular diseases, empowerment, selfmanagement education and lifestyle factors56 european journal of preventive cardiology 262swere used in diﬀerent combinations to identify eligible articles?",
      "What can you tell me about the following keywords diabetes mellitus, cardiovascular diseases,empowerment, selfmanagement education and lifestyle factors were used in different combinations to identifyeligible articles?",
      "Can type 1 diabetes be prevented?",
      "What can you tell me about effect of lifestyle inter vention in patients with type 2 diabetes a metaanalysis.metabolism 2015 64 338347?",
      "What can you tell me about efficacy of lifestyle interventions in patients with type 2 diabetes a systematic review and metaanalysis?",
      "Does regular exercise prevent diabetes?",
      "What can you tell me about prevention of diabetes mellitus requires an integrated and holistic approach based on the origin of the disease?",
      "Are there medications that I can take to prevent diabetes?",
      "Does maintaining a healthy weight help prevent diabetes?"
    ],
    "responses": [
      "Full research paper Lifestyle factors, selfmanagement and patient empowerment in diabetes care Ekaterini Lambrinou1, Tina B Hansen2,3and Joline WJ Beulens4,5 Abstract Although management of diabetes mellitus is improving, inadequately managed cases still exist.",
      "The following keywords diabetesmellitus, cardiovascular diseases, empowerment, selfmanagement education and lifestyle factors56 European Journal of Preventive Cardiology 262Swere used in diﬀerent combinations to identify eligible articles.",
      "Keywords Lifestyle factors, selfmanagement, patient empowerment, diabetes care, diabetes mellitus Received 2 July 2019 accepted 9 October 2019 Introduction Diabetes mellitus DM is a major public health problem, aﬀecting people of all ages worldwide.",
      "Influence of lifestyle on incident cardiovascular disease and mortality in patients with diabetes mellitus.",
      "The following keywords diabetes mellitus, cardiovascular diseases,empowerment, selfmanagement education and lifestyle factors were used in different combinations to identifyeligible articles.",
      "38The development of innovative diabetes care management is important inorder to provide continuity to care, improve healthylifestyle and reduce patient risk factors and comorbidities.",
      "Effect of lifestyle inter vention in patients with type 2 diabetes A metaanalysis.Metabolism 2015 64 338347.",
      "Balakumar P, MaungU K and Jagadeesh G. Prevalence and prevention of cardiovascular disease and diabetes mellitus.",
      "Prevent diabetes through maintaining a healthy weight, regular physical activity, balanced diet low in processed foods and sugars, regular health checkups, and stress management. Type 1 diabetes cannot be prevented.",
      "Important variables for the prevention of diabetes mellitus and its complications are selfmanagementof diabetes mellitus and the management of risk factors.",
      "Prevention of diabetes mellitus requires an integrated and holistic approach based on the origin of the disease.",
      "In this review, the role of the three main pillars indiabetes care are identified and discussed patient empowerment, selfmanagement education and lifestyle modification inthe management of people with diabetes mellitus.",
      "Efficacy of lifestyle interventions in patients with type 2 diabetes A systematic review and metaanalysis."
    ]
  },
  {
    "tag": "diabetes_diet",
    "patterns": [
      "What can you tell me about a network metaanalysis on the comparative efficacy ofdifferent dietary approaches on glycaemic control inpatients with type 2 diabetes mellitus?",
      "Can people with diabetes eat fruits?",
      "What can you tell me about 9andrews et al., in 2011, concluded that an intensive diet intervention as soon as possibleafter the diagnosis can improve glycaemic control in dm?",
      "What foods should people with diabetes avoid?",
      "What can you tell me about empowerment of persons with dm empowerment is a process whereby an individual has greater ability to determine their decisions and selfcare activities for their health.27in people with dm it is important to have suﬃcient diabetesrelated knowledgein order to increase patients empowerment?",
      "Can people with diabetes eat sugary foods?",
      "What can you tell me about dietary habits in type ii diabetes mellitus how is adherence to dietary recommendations??",
      "What is the best diet for people with diabetes?",
      "What are the best foods for people living with diabetes?",
      "Can people with diabetes consume carbohydrates?"
    ],
    "responses": [
      "Empowerment of persons with DM Empowerment is a process whereby an individual has greater ability to determine their decisions and selfcare activities for their health.27In people with DM it is important to have suﬃcient diabetesrelated knowledgein order to increase patients empowerment.",
      "A network metaanalysis on the comparative efficacy ofdifferent dietary approaches on glycaemic control inpatients with type 2 diabetes mellitus.",
      "9Andrews et al., in 2011, concluded that an intensive diet intervention as soon as possibleafter the diagnosis can improve glycaemic control in DM.",
      "Dietary habits in type II diabetes mellitus How is adherence to dietary recommendations?",
      "A diabetes-friendly diet includes whole grains, lean proteins, healthy fats, fruits, vegetables, and limited processed foods and sugars. Monitor carbohydrate intake and maintain regular meal times. Consult a dietitian for personalized advice."
    ]
  }
  {
    "tag": "diabetes_complications",
    "patterns": [
      "What can you tell me about the effect of tobacco cessation on weight gain, obesity, and diabetes risk?",
      "What can you tell me about alcohol consumption and risk of microvascular complications in type 1 diabetes patients the eurodiab prospectivecomplications study?",
      "What can you tell me about risk factors, mortality, and cardiovascular outcomes in patients with type 2 diabetes?",
      "What can you tell me about 14more speciﬁc complications of diabetes mostly macrovascular diseases accounted for morethan half of the lifetime direct medical costs amongpatients with dm?",
      "What can you tell me about frequent and intensive physical activity reduces risk of cardiovascular events in type 1 diabetes?",
      "What can you tell me about clinical and eco nomic impact of an integrated care team model on tar geted, highrisk medicare patients with type 2 diabetes.clin diabetes 2018 36 313318?",
      "What can you tell me about effectiveness of the multidisciplinary risk assessment and managementprogram for patients with diabetes mellitus ramp dm for diabetic microvascular complications apopulationbased cohort study?",
      "What can you tell me about effects of initiating moderate alcohol intake on cardiometabolicrisk in adults with type 2 diabetes a 2year randomized,controlled trial?",
      "What can you tell me about impact of physical activity on glycemic control and prevalence of cardiovascular risk factors in adults with type 1 diabetes a cross sectional multicenter study of 18,028 patients?"
    ],
    "responses": [
      "Effects of initiating moderate alcohol intake on cardiometabolicrisk in adults with type 2 diabetes A 2year randomized,controlled trial.",
      "Impact of physical activity on glycemic control and prevalence of cardiovascular risk factors in adults with type 1 diabetes A cross sectional multicenter study of 18,028 patients.",
      "14More speciﬁc complications of diabetes mostly macrovascular diseases accounted for morethan half of the lifetime direct medical costs amongpatients with DM.",
      "Frequent and intensive physical activity reduces risk of cardiovascular events in type 1 diabetes.",
      "Clinical and eco nomic impact of an integrated care team model on tar geted, highrisk medicare patients with type 2 diabetes.Clin Diabetes 2018 36 313318.",
      "Alcohol consumption and risk of microvascular complications in type 1 diabetes patients The EURODIAB ProspectiveComplications Study.",
      "Risk factors, mortality, and cardiovascular outcomes in patients with type 2 diabetes.",
      "Effectiveness of the multidisciplinary Risk Assessment and ManagementProgram for Patients with Diabetes Mellitus RAMP DM for diabetic microvascular complications Apopulationbased cohort study.",
      "The effect of tobacco cessation on weight gain, obesity, and diabetes risk."
    ]
  },
  "tag": "diet",
      "patterns": [
        "What can you tell me about all diabetic diets are not equal in terms of balance and nutrient quality?",
        "What can you tell me about july 17, 2020.food and nutrition?",
        "What can you tell me about remember to discuss your individual factors with your healthcare team to create a balanced meal plan tailored to your needs?",
        "What can you tell me about table sugar and honey were added to the adas list of food choices many years ago, when nutrition research determined that a carbohydrate is a carbohydrate?",
        "What can you tell me about when choosing the best meal planning method for you, an rdn will consider your medication schedule, lifestyle, food preferences, health and weight goals, and more to achieve a balanced diet tailored to your needs?",
        "What can you tell me about b vitamins and magnesium are compromised with neuropathy, and should be taken together with a nutrient dense diet?",
        "What can you tell me about below are some common nutritionrelated myths addressed by an rdn, along with the facts that debunk them?",
        "What can you tell me about exercise and nutrition questions q?",
        "What can you tell me about i have not gained any weight, i am on a pretty strict diet and yet my sugar doesnt run under 200 for more than a day even though i am taking 75 units of lantus?",
        "What can you tell me about if you can tolerate dairy milk, you will get more nutrition for your dollar than with a milk substitute?",
        "What can you tell me about choose lean meats and fish, and opt for fats like olive oil or avocado  in small amounts  for a more hearthealthy diet?",
        "What can you tell me about it can be prevented or delayed in many cases with diet and exercise changes?",
        "What can you tell me about academy of nutrition and dietetics?",
        "What can you tell me about consult your healthcare professional for an individualized meal plan guideline based on your needs?",
        "What can you tell me about eating an unrefined diet made up of whole, unprocessed foods is the best way to begin a more stable foundation?",
        "What can you tell me about breakfast does not need to be breakfast foods  you can figure out how to incorporate your favorites into your meal plan?",
        "What can you tell me about how does this mesh if at all with lowcarb diets??",
        "What can you tell me about in addition to providing nutrition solutions for adults and children, she provides nutrition communication services to the food and beverage industry and is the owner of supermarket savvy?",
        "What can you tell me about a the cdc strongly recommends that bloodtesting devices, including lancets, should never be used by more than one person to prevent any chance of infection, says connie crawley, rd, nutrition and health specialist at the university of georgia extension service in athens?",
        "What can you tell me about avoid added salt and high sodium foods  which is good for the whole family  for a more hearthealthy diet?",
        "What can you tell me about to help make informed food choices, the food and drug administration fda has updated the nutrition facts label for packaged foods to include a line item for added sugars?",
        "What can you tell me about if you can locate a nutritionist in your area who also will suggest appropriate vitaminmineral compounds and carbohydrate vs. protein amounts, that may be the boost you need.q can a type 2 diabetic become a type 1 diabetic after several years and how can i find out??",
        "What can you tell me about try to avoid foods that contain high amounts of added sugars, while continuing to focus on total carbohydrate when meal planning?",
        "What can you tell me about it sounds like you may need to start from square one with nutrition and overall management?",
        "What can you tell me about ask your healthcare provider for a referral or search the academy of nutrition and dietetics directory for an rdn in your area?",
        "How can I prepare for intensive exercise on a lowcarb diet?",
        "What can you tell me about check your favorite meal planning resource to help you stay within your carbohydrate goal for the meal?",
        "What can you tell me about always consult with your healthcare team before making changes to your diet to ensure that it is appropriate for your health and lifestyle?",
        "What can you tell me about 32keeping all that in mind, any healthy diet is likely to draw from the following, per federal guidelines vegetables fruits whole grains fatfree or lowfat milk and milk products unless you are vegetarian lean meats poultry fish beans eggs and nuts and seeds?",
        "What can you tell me about how can i prepare for intensive exercise on a lowcarb diet??",
        "What can you tell me about both white and sweet potatoes provide valuable nutrition such as fiber, magnesium, potassium, b vitamins, and more?",
        "What can you tell me about be sure to speak with your doctor before embarking on any diet or exercise plan, to ensure you are making changes that are safe and appropriate for you?",
        "What can you tell me about your individualized recommendations will be based on how low carb the diet is, your medications, and the length of the exercise?",
        "What can you tell me about if you are considering a keto diet, talk to your licensed healthcare professional first and give serious thought as to whether or not you think you could follow a very restricted meal plan for the long term?",
        "How does this mesh if at all with lowcarb diets?",
        "What can you tell me about have you been taking any nutritional supplements, or working a practitioner who understands this application??",
        "What can you tell me about it is even less likely if you live a healthy lifestyle for both diet and activity?"
      ],
      "responses": [
        "July 17, 2020.Food and Nutrition.",
        "Your individualized recommendations will be based on how low carb the diet is, your medications, and the length of the exercise.",
        "Try to avoid foods that contain high amounts of added sugars, while continuing to focus on total carbohydrate when meal planning.",
        "Remember to discuss your individual factors with your healthcare team to create a balanced meal plan tailored to your needs.",
        "Avoid added salt and high sodium foods  which is good for the whole family  for a more hearthealthy diet.",
        "A.",
        "If you can locate a nutritionist in your area who also will suggest appropriate vitaminmineral compounds and carbohydrate vs. protein amounts, that may be the boost you need.Q Can a type 2 diabetic become a type 1 diabetic after several years and how can I find out?",
        "It is even less likely if you live a healthy lifestyle for both diet and activity.",
        "Always consult with your healthcare team before making changes to your diet to ensure that it is appropriate for your health and lifestyle.",
        "If you can tolerate dairy milk, you will get more nutrition for your dollar than with a milk substitute.",
        "When choosing the best meal planning method for you, an RDN will consider your medication schedule, lifestyle, food preferences, health and weight goals, and more to achieve a balanced diet tailored to your needs.",
        "To help make informed food choices, the Food and Drug Administration FDA has updated the nutrition facts label for packaged foods to include a line item for added sugars.",
        "Check your favorite meal planning resource to help you stay within your carbohydrate goal for the meal.",
        "Table sugar and honey were added to the ADAs list of food choices many years ago, when nutrition research determined that a carbohydrate is a carbohydrate.",
        "Both white and sweet potatoes provide valuable nutrition such as fiber, magnesium, potassium, B vitamins, and more.",
        "In addition to providing nutrition solutions for adults and children, she provides nutrition communication services to the food and beverage industry and is the owner of Supermarket Savvy.",
        "I have not gained any weight, I am on a pretty strict diet and yet my sugar doesnt run under 200 for more than a day even though I am taking 75 units of Lantus.",
        "Eating an unrefined diet made up of whole, unprocessed foods is the best way to begin a more stable foundation.",
        "Exercise and nutrition questions Q.",
        "How can I prepare for intensive exercise on a lowcarb diet?",
        "It sounds like you may need to start from square one with nutrition and overall management.",
        "Have you been taking any nutritional supplements, or working a practitioner who understands this application?",
        "Ask your healthcare provider for a referral or search the Academy of Nutrition and Dietetics directory for an RDN in your area.",
        "All diabetic diets are not equal in terms of balance and nutrient quality.",
        "Consult your healthcare professional for an individualized meal plan guideline based on your needs.",
        "It can be prevented or delayed in many cases with diet and exercise changes.",
        "Below are some common nutritionrelated myths addressed by an RDN, along with the facts that debunk them.",
        "Breakfast does not need to be breakfast foods  you can figure out how to incorporate your favorites into your meal plan.",
        "A The CDC strongly recommends that bloodtesting devices, including lancets, should never be used by more than one person to prevent any chance of infection, says Connie Crawley, RD, nutrition and health specialist at the University of Georgia Extension Service in Athens.",
        "How does this mesh if at all with lowcarb diets?",
        "B vitamins and magnesium are compromised with neuropathy, and should be taken together with a nutrient dense diet.",
        "Be sure to speak with your doctor before embarking on any diet or exercise plan, to ensure you are making changes that are safe and appropriate for you.",
        "32Keeping all that in mind, any healthy diet is likely to draw from the following, per federal guidelines vegetables fruits whole grains fatfree or lowfat milk and milk products unless you are vegetarian lean meats poultry fish beans eggs and nuts and seeds.",
        "If you are considering a keto diet, talk to your licensed healthcare professional first and give serious thought as to whether or not you think you could follow a very restricted meal plan for the long term.",
        "Academy of Nutrition and Dietetics.",
        "Choose lean meats and fish, and opt for fats like olive oil or avocado  in small amounts  for a more hearthealthy diet."
      ]
    },
    {
      "tag": "blood_sugar",
      "patterns": [
        "What can you tell me about what else could i eat for breakfast thats easy to make and ok for my blood sugar??",
        "Is this true?A In general blood sugars are far better managed with a controlled, regular eating pattern.",
        "What can you tell me about an early sign of perimenopause for women who take insulin is hypoglycemia due to dropping progesterone?",
        "What can you tell me about without that hormone, blood sugar rises too high, causing hyperglycemia.we dont know exactly what triggers this autoimmune process to start, says charles scott thomas, md, an endocrinologist at kaiser permanente los angeles medical center in los angeles?",
        "What can you tell me about what type of preworkout food is good to maintain blood sugar during highintensity aerobic exercise to prevents lows??",
        "What can you tell me about if this persists and if his glucose stays elevated in spite of any efforts on his part for correction, have him see his physician?",
        "What can you tell me about why does this happen?a have you had an oral glucose tolerance test??",
        "What can you tell me about extreme anger and hostility?a erratic blood sugars can cause mood swings, such as one would expect with untreated bipolar disorder?",
        "What can you tell me about q can very low blood sugars cause depression and cause someone to act like a different person, ex?",
        "What can you tell me about severe neuropathy would reflects years of hyperglycemia, and would generally manifest first as peripheral neuropathy?",
        "What can you tell me about you may be questioning what foods will lower blood sugar quickly?",
        "What can you tell me about a tiny sensor that is thinner than a needle and around ½ inch long is inserted under the skin to measure glucose levels in the fluid between fat cells?",
        "What can you tell me about there are those who still produce some insulin, but not at sufficient amounts so to control their blood sugars without taking insulin?",
        "What can you tell me about make sure you have essential fatty acids in your intake fishplant foods are main sources.q what is normal glucose levels with the finger prick method meter on both one and two hour tests for nondiabetics??",
        "What can you tell me about the truth is, there are no foods that have this effect on blood sugar?",
        "What can you tell me about i have been overweight for years and have been having my blood sugar checked at biannual doctors appointments, always to be told it was fine?",
        "What can you tell me about those on an oral medication will want to monitor blood sugar frequently throughout the intensive exercise and may decide to consume a 15 gram carbohydrate snack prior to the exercise?",
        "What can you tell me about does it matter if i get my blood sample from somewhere else on my body?a fingertips on the sides of tips offer a more reliable capillary flow and reading because changes in glucose levels are detected here more rapidly?",
        "What can you tell me about all of a sudden my a1c is 10.1 with a fasting blood sugar of 329 and i was diagnosed as type 2 diabetic and placed on insulin immediately.a with blood sugars over 300, it is now the thought of many endocrinologists to start a person on insulin to detoxify the beta cells of the pancreas?",
        "What can you tell me about to stay healthy, keep your blood sugar, blood pressure, and cholesterol under good control?",
        "What can you tell me about the lower your blood sugar is, the bigger snack you may need?",
        "What can you tell me about it is most important that you stay well hydrated, as elevated glucose can be most dehydrating, leading to headaches and dizziness?",
        "What can you tell me about a erratic glucose levels can mimic bipolar behavior and potentially be harmful to you both?",
        "What can you tell me about a the reason we need insulinas a hormone made in our bodies or as a medicationis to push glucose into cells for energy?",
        "What can you tell me about newer research is placing more emphasis on the after meal glucose elevations as opposed to just monitoring fasting glucose?",
        "What can you tell me about if your blood sugar is over 250 mgdl, do not exercise without enough insulin on board, your blood sugar could go even higher?",
        "What can you tell me about blood sugar is controlled by focusing on total carbohydrate consumed, not natural or added sugars?",
        "What can you tell me about in my many years of counseling, i have seen very few folks with a bmi over 30  in the obese classification  that dont have elevated or elevating glucose?",
        "What can you tell me about you would do well to watch your carbohydrate intake, especially in the morning, but you should not have blood sugars this low during the day?",
        "What can you tell me about 22patients are able to get realtime information about their blood sugar and also see trends, says thomas?",
        "What can you tell me about q what should my blood sugar be when i wake up fasting and before meals??",
        "What can you tell me about q while being treated for pancreatitis in the icu for the second time, i was told that my blood sugar was 422 and that i am diabetic?",
        "What can you tell me about if your blood sugar has been high for a while prior to starting insulin, youve likely been excreting calories in your urine instead of fueling your body?",
        "What can you tell me about 1,11hemoglobin a1c test shows how high your blood sugar has been, on average, over the past three months?",
        "What can you tell me about i may take my blood glucose reading 12 times a day to see where im at?",
        "What can you tell me about you are experiencing hyperglycemia, which as an initial diagnosis, generally manifests as slowly elevating fasting glucose?",
        "What can you tell me about a you may not be able to prevent a blood sugar spike after meals if you do not have enough insulin or medication on board at mealtime?",
        "What can you tell me about i recently took my blood sugar a few times and the results scared me 170 when i woke up?",
        "What can you tell me about they dont lower glucose as much as insulin, in part because with insulin you can keep increasing the dose as needed, kent says?",
        "What can you tell me about a handful of dry roasted nuts can curb a low blood sugar episode?",
        "What can you tell me about if you experience hypoglycemia low blood sugar, treat it with just 15 grams of carb?",
        "What can you tell me about that serves to help them to understand how food, sleep, exercise, and stress all affect their blood sugar, and how to avoid risky swings in glucose levels.when an insulin pump and cgm are integrated, the cgm can deliver information to the pump about the patients current blood sugar level and the trend of the blood sugar?",
        "What can you tell me about therefore, it is recommended to always test your blood sugar before a workout, and if you feel symptoms of hypoglycemia at any time during a workout?",
        "What can you tell me about q how often should i replace my glucose meter??",
        "What can you tell me about 31whatever diet you settle on is likely to include some form of carb counting monitoring your intake of carbohydrates, which break down into glucose and a balance of protein, fat, and fiber to help stabilize blood sugar?",
        "What can you tell me about it is a lifelong illness that requires careful management of blood sugar levels each day in order to make sure that they stay within a healthy range?",
        "What can you tell me about symptoms may include fruity smelling breath, high blood sugar, excessive thirst, frequent urination, nausea and vomiting?",
        "What can you tell me about a balanced mix of protein, carbohydrate, and fat at each meal can help keep blood sugar stable?",
        "What can you tell me about a that is very high and needs to come down somewhat gradually so as not to experience feelings of low blood sugars?",
        "What can you tell me about this allows the pump to potentially alter insulin delivery to help maintain blood sugars more within a healthy range, says thomas?",
        "What else could I eat for breakfast thats easy to make and OK for my blood sugar?",
        "What can you tell me about q can my a1c be high if my fasting readings are lower than 130?a if you have never been tested for a 3 hour glucose tolerance test, showing how you react at 1, 2, and 3 hour intervals?",
        "What can you tell me about the first goal would be to maintain stable glucose levels, as fluctuating levels can certainly affect good sleep?",
        "What can you tell me about the glucoselowering medications, other than insulin, available today mainly pills and a few injectables use various routes to lower glucose levels?",
        "What can you tell me about but a healthy lifestyle will help you keep your blood sugar in a healthy range?",
        "What can you tell me about is this true?a in general blood sugars are far better managed with a controlled, regular eating pattern?",
        "What can you tell me about if your blood sugar is in your normal range prior to the workout, many people like to eat a piece of fruit beforehand to consume the recommended 15 grams of carbohydrate?",
        "What can you tell me about if your blood sugar is below target range at bedtime, a very general guideline would be to consume 15 grams of carbohydrate and a protein serving?",
        "What can you tell me about before the one hour glucose test, i ate a whole bagel with cream cheese, and whole banana and about 12 oz?",
        "What can you tell me about it is best to drink alcohol with a meal and only when your blood sugar is under good control?",
        "What can you tell me about increased body fat appears to interfere at the cellular level with the uptake of glucose from the bloodstream into the cell the job of insulin?",
        "What can you tell me about an overview of insulin pumps and glucose sensors for the generalist?",
        "What can you tell me about my reading came back as 157 and now after being on the diet for 3 days, my blood sugar levels have not gone over 80 and have gone as low as 52?",
        "What can you tell me about this wont happen once your blood sugar is under control?",
        "What can you tell me about among them are improved blood sugar, blood pressure, and cholesterol levels and possibly taking fewer medications or lower doses?",
        "What can you tell me about although alcoholic drinks are made from grains or fruits starches or sugars through the processes of fermentation and distillation, alcohol cannot be changed into glucose, she says?",
        "What can you tell me about check your glucose levels and analyze your monthly fluctuations to know your patterns, she says?",
        "What can you tell me about he is obviously experiencing highlow glucose level swings?",
        "What can you tell me about the algorithm decides based on the cgm reading and the average over the last five minutes, to tell the pump, you dose x number of units of insulin, and it goes up and down depending on your glucose levels?",
        "Should I Always Have Glucose Tabs?",
        "What can you tell me about i take a blood glucose reading first thing in the morning, right before i go to bed, before every meal, before every snack, before anything goes in my mouth i take a reading?",
        "What can you tell me about drink water, as you can become dehydrated when your blood sugar is high?",
        "What can you tell me about some medications can cause hypoglycemia, including insulin those in the sulfonylurea category, such as glyburide diabeta, glynase, micronase, glipizide glucotrol, and glimepiride amaryl and those in the glinide category, such as repaglinide prandin and nateglinide starlix?",
        "What can you tell me about during perimenopause, estrogen and progesterone can fluctuate and lead to glucose swings, strand says?",
        "What can you tell me about for an easy comparison, one tablespoon of honey or table sugar equals 15 grams of carbohydrate, and affects blood sugar the same as a medium orange?",
        "What can you tell me about dont miss 12 healthy ways to lower your blood sugar what should my fasting and normal blood sugar be??",
        "What can you tell me about you can also start testing your glucose one hour after meals to see how high you rise, especially on those bad days?",
        "What can you tell me about a how much carbohydrate you need to consume prior to a workout depends on what your blood sugar is before the workout?",
        "What can you tell me about july 2017.blood sugar and insulin at work?",
        "What can you tell me about combined with glucose monitoring, this is the primary way that blood sugar is kept within a healthy range every day.insulin therapytwo main types of insulin are injected to get you through the day 16, 17basal insulin is injected to stay in the body 24 hours a day, always, regardless of when you eat?",
        "What can you tell me about this is especially important when treating hypoglycemia?",
        "What can you tell me about the hormone insulin, produced by the pancreas, regulates the amount of glucose in your blood by helping liver, muscle, and fat cells absorb the sugar?",
        "What can you tell me about some folks do better with an insulin pump in such cases.q why do i feel shaky when my blood sugar is under 90?a blood sugar provides fuel for the brain, heart, and for our whole system?",
        "What can you tell me about q can your menstrual cycle andor going through menopause affect glucose levels??",
        "What can you tell me about what this means is that you can get your blood sugars under control and within normal ranges, and maintain the healthy lifestyle required to stay within range?",
        "What can you tell me about just continue to follow a very healthy lifestyle with attention to eating unrefined foods as much as possible, as blood sugars are always subject to change over the life cycle.q can i drink water during the two hour period before testing my blood sugar?a of course water is a major nutrient, as we are composed of at least 60 water?",
        "What can you tell me about if you have ever gone for long periods without food and experienced a feeling of irritability as a result, magnify that many times for blood sugars dropping suddenly too low, or blood sugars that roller coaster day to day?",
        "What can you tell me about ideally, your fasting glucose should be closer to 80?",
        "What can you tell me about your glucose levels should be under 100 ideally between 8090?",
        "What can you tell me about if concerned, you can buy strips at the pharmacy to test urine for the presence of ketones.q why do i need to fast for 10 hours before a fasting glucose blood test?a this time frame gives your body a chance to digest all food in your system to more readily determine what your true fasting blood sugar is?",
        "What can you tell me about it is calorie free, so it will not raise your blood sugar?",
        "What can you tell me about however, drinking more than three drinks per day over time has been shown to make glucose control a challenge?",
        "What can you tell me about one to two hours after eating, a postprandial blood sugar reading at or under 180 mgdl is recommended?",
        "Why does this happen?A Have you had an Oral Glucose Tolerance Test?",
        "What can you tell me about april 4, 2019.continuous glucose monitoring?",
        "What type of preworkout food is good to maintain blood sugar during highintensity aerobic exercise to prevents lows?",
        "What can you tell me about testing your blood sugar after periods of physical activity can help you understand how your body responds to particular activities and plan accordingly?",
        "What can you tell me about if your daughters blood sugars are in exquisite control, and your medical team knows of a place that has met some standard, then something small may work, particularly if your daughter is rebellious, and would go out and do this on her own, but in poor conditions?",
        "What can you tell me about diabetic ketoacidosis dka happens when insulin drops and the body cant use your rising blood glucose as fuel it turns to burning fat instead, leading to a toorapid buildup of acids in the bloodstream, known as ketones?",
        "What can you tell me about your vial of strips gives you a glucose range in which the result should fall?",
        "What can you tell me about a right now, it is most important that you learn to eat correctly for hypoglycemia i.e?",
        "Why not?A This recommendation is more of a caution for those who have neuropathy and may not feel if the pad gets too hot and could be burned as a result.Q Do I need to fast before having an A1C test?A No, fasting is not required for an A1C because the test measures your average blood glucose levels over the past three months.",
        "What can you tell me about according to the ada, blood sugar levels can be affected after exercise for up to 24 hours or more as insulin sensitivity is increased, so keep this in mind for meals and insulin dosing following physical activity?",
        "What can you tell me about people with the disease typically monitor their own blood sugar, using one of the following methodsglucose meter this is a portable device that analyzes a sample of your blood, which you collect by sticking your finger with a lancet and then placing the blood drop on a disposable test strip?",
        "What can you tell me about if your blood sugar is over 250 mgdl for two tests in a row, contact your healthcare professional?",
        "What can you tell me about you can quickly reduce your blood sugar by eating certain foods?",
        "What can you tell me about menopause also can affect blood sugar?",
        "What can you tell me about january 2016.blood glucose monitoring devices?",
        "What can you tell me about if he refuses to do anything to better control himself, you may have to take a tough love stand for your own wellbeing and possible protection.q does having low blood sugar readings of 60 or 70 affect my a1c level??",
        "What can you tell me about a yes and yes its common for women to have hormone fluctuations the week before their period, and those can affect glucose control?",
        "What can you tell me about if your blood sugar is above range, go for a walk and increase your physical activity to lower it?",
        "What can you tell me about 11fasting plasma glucose test checks how high your blood sugar is after youve had nothing to eat or drink except small sips or water for at least eight hours?",
        "What can you tell me about mealtime questions q what type of foods prevent a blood sugar spike after meals??",
        "What can you tell me about however, i can have a normal blood sugar reading of about 90 before breakfast and then after a moderate cerealtoast breakfast, my blood sugar will go over 200?",
        "What can you tell me about weight loss is secondary to consistently good habits.q do i use the first or the second drop of blood when testing my blood sugar?a with most strips now, you can touch them with the first drop?",
        "What can you tell me about but if weight loss is a goal and you arent at risk of hypoglycemia, just drink waterditto for after exercise?",
        "What can you tell me about the most important focus would be for him to first get blood sugars under control and be in good health?",
        "What can you tell me about this is because an insulin bolus needs to be taken when carbohydrate is consumed, unless one is treating a low blood sugar?",
        "What can you tell me about for people who take insulin or another blood glucoselowering medication that can cause hypoglycemia, eat some food when drinking alcohol?",
        "What can you tell me about if your blood sugar is less than 100 mgdl prior to the workout, the centers for disease control and prevention cdc recommends a 1530 gram carb snack?",
        "What can you tell me about q should i always carry glucose tablets??",
        "What can you tell me about examples of intermediate and longacting insulins that are slowly released into the bloodstream so that they last include isophane humulin n, detemir levemir, deludec tresiba, and glargine lantus.bolus or mealtime insulin is injected to cover the glucose you get through food?",
        "What can you tell me about include a serving of almonds or walnuts to help you feel full longer and possibly help stabilize blood sugar?",
        "What can you tell me about sugar surfing is a method that one noted endocrinologist uses to manage blood sugar based on carbs consumed at a meal?",
        "What can you tell me about also, including a small amount of healthy fat can help to stabilize blood sugar?",
        "What can you tell me about a a1c is a 1.5 to three month average of your glucose levels?",
        "What can you tell me about low blood sugar?",
        "What can you tell me about these are the first ingredients to a healthier life.q how many times a day should i take my blood sugar??",
        "What can you tell me about these not only taste good, they also have a slower effect on blood sugar?",
        "What can you tell me about estrogen can make women more sensitive to insulin and cause hypoglycemia?",
        "What can you tell me about 17pramlintide this medication is taken with mealtime insulin and slows the movement of food through the stomach to keep blood sugar from spiking after a meal?",
        "What can you tell me about based on your treatment regimen, you might find that adding a protein to your breakfast helps keep you full and your blood sugar stable?",
        "What can you tell me about 21continuous glucose monitor cgm you wear this device around the clock while it measures and reports your blood sugar level?",
        "What can you tell me about you will want to monitor your blood sugar more closely during and after drinking, as it can lead to a low blood sugar?",
        "What can you tell me about this would generally not occur unless glucose levels were very elevated over a longer period where the cells, needing fuel, rapidly break down fat to help keep you alive?",
        "What can you tell me about patients provide information to the pump about the amount of carbohydrates they plan to eat and their current blood sugar level and the pump can suggest an insulin dose to deliver, thomas explains.a slim majority of the 7.4 million insulin users in the united states 53 percent were injecting with vials and syringes as of 2016, followed by prefilled insulin pen users 46 percent?",
        "What can you tell me about should i always have glucose tabs??",
        "What can you tell me about these situations raise stress, and stress can raise blood sugar levels?",
        "What can you tell me about q does drinking black coffee impact a fasting test?a caffeine is a central nervous system stimulator, and may have a short term effect on blood sugars?",
        "What can you tell me about why not?a this recommendation is more of a caution for those who have neuropathy and may not feel if the pad gets too hot and could be burned as a result.q do i need to fast before having an a1c test?a no, fasting is not required for an a1c because the test measures your average blood glucose levels over the past three months?",
        "What can you tell me about glucose levels often return to their usual patterns after the first few days of the menstrual cycle?"
      ],
      "responses": [
        "Q While being treated for pancreatitis in the ICU for the second time, I was told that my blood sugar was 422 and that I am diabetic.",
        "Some folks do better with an insulin pump in such cases.Q Why do I feel shaky when my blood sugar is under 90?A Blood sugar provides fuel for the brain, heart, and for our whole system.",
        "low blood sugar.",
        "If concerned, you can buy strips at the pharmacy to test urine for the presence of ketones.Q Why do I need to fast for 10 hours before a fasting glucose blood test?A This time frame gives your body a chance to digest all food in your system to more readily determine what your true fasting blood sugar is.",
        "Q Is diabetes causing me to be tired and sleepy after eating?A Elevated blood sugar levels send a signal to the brain to release serotonin, a hormone that is both calming and sleep inducing.",
        "April 4, 2019.Continuous Glucose Monitoring.",
        "Is this true?A In general blood sugars are far better managed with a controlled, regular eating pattern.",
        "Based on your treatment regimen, you might find that adding a protein to your breakfast helps keep you full and your blood sugar stable.",
        "Weight loss is secondary to consistently good habits.Q Do I use the first or the second drop of blood when testing my blood sugar?A With most strips now, you can touch them with the first drop.",
        "A Right now, it is most important that you learn to eat correctly for hypoglycemia i.e.",
        "Erratic eating, such as fasting and then eating large amounts, is perceived by the body as binge eating.",
        "One to two hours after eating, a postprandial blood sugar reading at or under 180 mgdl is recommended.",
        "A The reason we need insulinas a hormone made in our bodies or as a medicationis to push glucose into cells for energy.",
        "I may take my blood glucose reading 12 times a day to see where Im at.",
        "Symptoms may include fruity smelling breath, high blood sugar, excessive thirst, frequent urination, nausea and vomiting.",
        "It is a lifelong illness that requires careful management of blood sugar levels each day in order to make sure that they stay within a healthy range.",
        "I take a blood glucose reading first thing in the morning, right before I go to bed, before every meal, before every snack, before anything goes in my mouth I take a reading.",
        "You are experiencing hyperglycemia, which as an initial diagnosis, generally manifests as slowly elevating fasting glucose.",
        "You may be questioning what foods will lower blood sugar quickly.",
        "You would do well to watch your carbohydrate intake, especially in the morning, but you should not have blood sugars this low during the day.",
        "For an easy comparison, one tablespoon of honey or table sugar equals 15 grams of carbohydrate, and affects blood sugar the same as a medium orange.",
        "This would generally not occur unless glucose levels were very elevated over a longer period where the cells, needing fuel, rapidly break down fat to help keep you alive.",
        "Ideally, your fasting glucose should be closer to 80.",
        "Q What should my blood sugar be when I wake up fasting and before meals?",
        "Therefore, it is recommended to always test your blood sugar before a workout, and if you feel symptoms of hypoglycemia at any time during a workout.",
        "31Whatever diet you settle on is likely to include some form of carb counting monitoring your intake of carbohydrates, which break down into glucose and a balance of protein, fat, and fiber to help stabilize blood sugar.",
        "A handful of dry roasted nuts can curb a low blood sugar episode.",
        "Glucose levels often return to their usual patterns after the first few days of the menstrual cycle.",
        "If your blood sugar is in your normal range prior to the workout, many people like to eat a piece of fruit beforehand to consume the recommended 15 grams of carbohydrate.",
        "January 2016.Blood Glucose Monitoring Devices.",
        "I recently took my blood sugar a few times and the results scared me 170 when I woke up.",
        "Q Can my A1C be high if my fasting readings are lower than 130?A If you have never been tested for a 3 hour glucose tolerance test, showing how you react at 1, 2, and 3 hour intervals.",
        "A That is very high and needs to come down somewhat gradually so as not to experience feelings of low blood sugars.",
        "My reading came back as 157 and now after being on the diet for 3 days, my blood sugar levels have not gone over 80 and have gone as low as 52.",
        "An early sign of perimenopause for women who take insulin is hypoglycemia due to dropping progesterone.",
        "These not only taste good, they also have a slower effect on blood sugar.",
        "That serves to help them to understand how food, sleep, exercise, and stress all affect their blood sugar, and how to avoid risky swings in glucose levels.When an insulin pump and CGM are integrated, the CGM can deliver information to the pump about the patients current blood sugar level and the trend of the blood sugar.",
        "If you have ever gone for long periods without food and experienced a feeling of irritability as a result, magnify that many times for blood sugars dropping suddenly too low, or blood sugars that roller coaster day to day.",
        "The algorithm decides based on the CGM reading and the average over the last five minutes, to tell the pump, You dose X number of units of insulin, and it goes up and down depending on your glucose levels.",
        "Sugar Surfing is a method that one noted endocrinologist uses to manage blood sugar based on carbs consumed at a meal.",
        "Also, including a small amount of healthy fat can help to stabilize blood sugar.",
        "21Continuous Glucose Monitor CGM You wear this device around the clock while it measures and reports your blood sugar level.",
        "Estrogen can make women more sensitive to insulin and cause hypoglycemia.",
        "It is best to drink alcohol with a meal and only when your blood sugar is under good control.",
        "The truth is, there are no foods that have this effect on blood sugar.",
        "A You may not be able to prevent a blood sugar spike after meals if you do not have enough insulin or medication on board at mealtime.",
        "A A1C is a 1.5 to three month average of your glucose levels.",
        "22Patients are able to get realtime information about their blood sugar and also see trends, says Thomas.",
        "It is calorie free, so it will not raise your blood sugar.",
        "This is especially important when treating hypoglycemia.",
        "Your vial of strips gives you a glucose range in which the result should fall.",
        "Just continue to follow a very healthy lifestyle with attention to eating unrefined foods as much as possible, as blood sugars are always subject to change over the life cycle.Q Can I drink water during the two hour period before testing my blood sugar?A Of course Water is a major nutrient, as we are composed of at least 60 water.",
        "He is obviously experiencing highlow glucose level swings.",
        "You can quickly reduce your blood sugar by eating certain foods.",
        "What else could I eat for breakfast thats easy to make and OK for my blood sugar?",
        "extreme anger and hostility?A Erratic blood sugars can cause mood swings, such as one would expect with untreated bipolar disorder.",
        "A tiny sensor that is thinner than a needle and around ½ inch long is inserted under the skin to measure glucose levels in the fluid between fat cells.",
        "There are those who still produce some insulin, but not at sufficient amounts so to control their blood sugars without taking insulin.",
        "For people who take insulin or another blood glucoselowering medication that can cause hypoglycemia, eat some food when drinking alcohol.",
        "These situations raise stress, and stress can raise blood sugar levels.",
        "An Overview of Insulin Pumps and Glucose Sensors for the Generalist.",
        "All of a sudden my A1c is 10.1 with a fasting blood sugar of 329 and I was diagnosed as type 2 diabetic and placed on insulin immediately.A With blood sugars over 300, it is now the thought of many endocrinologists to start a person on insulin to detoxify the beta cells of the pancreas.",
        "What this means is that you can get your blood sugars under control and within normal ranges, and maintain the healthy lifestyle required to stay within range.",
        "If your blood sugar is above range, go for a walk and increase your physical activity to lower it.",
        "If your blood sugar is over 250 mgdL for two tests in a row, contact your healthcare professional.",
        "Mealtime questions Q What type of foods prevent a blood sugar spike after meals?",
        "The first goal would be to maintain stable glucose levels, as fluctuating levels can certainly affect good sleep.",
        "Q Does drinking black coffee impact a fasting test?A Caffeine is a central nervous system stimulator, and may have a short term effect on blood sugars.",
        "A Erratic glucose levels can mimic bipolar behavior and potentially be harmful to you both.",
        "According to the ADA, blood sugar levels can be affected after exercise for up to 24 hours or more as insulin sensitivity is increased, so keep this in mind for meals and insulin dosing following physical activity.",
        "Should I Always Have Glucose Tabs?",
        "The most important focus would be for him to first get blood sugars under control and be in good health.",
        "Diabetic ketoacidosis DKA happens when insulin drops and the body cant use your rising blood glucose as fuel it turns to burning fat instead, leading to a toorapid buildup of acids in the bloodstream, known as ketones.",
        "This allows the pump to potentially alter insulin delivery to help maintain blood sugars more within a healthy range, says Thomas.",
        "Among them are improved blood sugar, blood pressure, and cholesterol levels and possibly taking fewer medications or lower doses.",
        "A How much carbohydrate you need to consume prior to a workout depends on what your blood sugar is before the workout.",
        "Q Can your menstrual cycle andor going through menopause affect glucose levels?",
        "Examples of intermediate and longacting insulins that are slowly released into the bloodstream so that they last include isophane Humulin N, detemir Levemir, deludec Tresiba, and glargine Lantus.Bolus or mealtime insulin is injected to cover the glucose you get through food.",
        "If he refuses to do anything to better control himself, you may have to take a tough love stand for your own wellbeing and possible protection.Q Does having low blood sugar readings of 60 or 70 affect my A1C level?",
        "They dont lower glucose as much as insulin, in part because with insulin you can keep increasing the dose as needed, Kent says.",
        "A.",
        "If your daughters blood sugars are in exquisite control, and your medical team knows of a place that has met some standard, then something small may work, particularly if your daughter is rebellious, and would go out and do this on her own, but in poor conditions.",
        "Q Should I always carry glucose tablets?",
        "These are the first ingredients to a healthier life.Q How many times a day should I take my blood sugar?",
        "However, I can have a normal blood sugar reading of about 90 before breakfast and then after a moderate cerealtoast breakfast, my blood sugar will go over 200.",
        "People with the disease typically monitor their own blood sugar, using one of the following methodsGlucose Meter This is a portable device that analyzes a sample of your blood, which you collect by sticking your finger with a lancet and then placing the blood drop on a disposable test strip.",
        "Testing your blood sugar after periods of physical activity can help you understand how your body responds to particular activities and plan accordingly.",
        "Q How often should I replace my glucose meter?",
        "Check your glucose levels and analyze your monthly fluctuations to know your patterns, she says.",
        "Why does this happen?A Have you had an Oral Glucose Tolerance Test?",
        "The glucoselowering medications, other than insulin, available today mainly pills and a few injectables use various routes to lower glucose levels.",
        "If you experience hypoglycemia low blood sugar, treat it with just 15 grams of carb.",
        "What type of preworkout food is good to maintain blood sugar during highintensity aerobic exercise to prevents lows?",
        "Why not?A This recommendation is more of a caution for those who have neuropathy and may not feel if the pad gets too hot and could be burned as a result.Q Do I need to fast before having an A1C test?A No, fasting is not required for an A1C because the test measures your average blood glucose levels over the past three months.",
        "This is because an insulin bolus needs to be taken when carbohydrate is consumed, unless one is treating a low blood sugar.",
        "Make sure you have essential fatty acids in your intake fishplant foods are main sources.Q What is normal glucose levels with the finger prick method meter on both one and two hour tests for nondiabetics?",
        "A balanced mix of protein, carbohydrate, and fat at each meal can help keep blood sugar stable.",
        "If your blood sugar is below target range at bedtime, a very general guideline would be to consume 15 grams of carbohydrate and a protein serving.",
        "I have been overweight for years and have been having my blood sugar checked at biannual doctors appointments, always to be told it was fine.",
        "However, drinking more than three drinks per day over time has been shown to make glucose control a challenge.",
        "In my many years of counseling, I have seen very few folks with a BMI over 30  in the obese classification  that dont have elevated or elevating glucose.",
        "Combined with glucose monitoring, this is the primary way that blood sugar is kept within a healthy range every day.Insulin TherapyTwo main types of insulin are injected to get you through the day 16, 17Basal insulin is injected to stay in the body 24 hours a day, always, regardless of when you eat.",
        "1,11Hemoglobin A1C test shows how high your blood sugar has been, on average, over the past three months.",
        "But if weight loss is a goal and you arent at risk of hypoglycemia, just drink waterditto for after exercise.",
        "During perimenopause, estrogen and progesterone can fluctuate and lead to glucose swings, Strand says.",
        "A Yes and yes Its common for women to have hormone fluctuations the week before their period, and those can affect glucose control.",
        "Although alcoholic drinks are made from grains or fruits starches or sugars through the processes of fermentation and distillation, alcohol cannot be changed into glucose, she says.",
        "This wont happen once your blood sugar is under control.",
        "Q Can very low blood sugars cause depression and cause someone to act like a different person, ex.",
        "Without that hormone, blood sugar rises too high, causing hyperglycemia.We dont know exactly what triggers this autoimmune process to start, says Charles Scott Thomas, MD, an endocrinologist at Kaiser Permanente Los Angeles Medical Center in Los Angeles.",
        "July 2017.Blood Sugar and Insulin at Work.",
        "If this persists and if his glucose stays elevated in spite of any efforts on his part for correction, have him see his physician.",
        "The lower your blood sugar is, the bigger snack you may need.",
        "If your blood sugar is over 250 mgdL, do not exercise without enough insulin on board, your blood sugar could go even higher.",
        "If your blood sugar has been high for a while prior to starting insulin, youve likely been excreting calories in your urine instead of fueling your body.",
        "Your glucose levels should be under 100 ideally between 8090.",
        "If your blood sugar is less than 100 mgdL prior to the workout, the Centers for Disease Control and Prevention CDC recommends a 1530 gram carb snack.",
        "Some medications can cause hypoglycemia, including insulin those in the sulfonylurea category, such as glyburide Diabeta, Glynase, Micronase, glipizide Glucotrol, and glimepiride Amaryl and those in the glinide category, such as repaglinide Prandin and nateglinide Starlix.",
        "Patients provide information to the pump about the amount of carbohydrates they plan to eat and their current blood sugar level and the pump can suggest an insulin dose to deliver, Thomas explains.A slim majority of the 7.4 million insulin users in the United States 53 percent were injecting with vials and syringes as of 2016, followed by prefilled insulin pen users 46 percent.",
        "Include a serving of almonds or walnuts to help you feel full longer and possibly help stabilize blood sugar.",
        "Severe neuropathy would reflects years of hyperglycemia, and would generally manifest first as peripheral neuropathy.",
        "Newer research is placing more emphasis on the after meal glucose elevations as opposed to just monitoring fasting glucose.",
        "Drink water, as you can become dehydrated when your blood sugar is high.",
        "Dont Miss 12 Healthy Ways to Lower Your Blood Sugar What Should My Fasting and Normal Blood Sugar Be?",
        "Blood sugar is controlled by focusing on total carbohydrate consumed, not natural or added sugars.",
        "It is most important that you stay well hydrated, as elevated glucose can be most dehydrating, leading to headaches and dizziness.",
        "But a healthy lifestyle will help you keep your blood sugar in a healthy range.",
        "Menopause also can affect blood sugar.",
        "Before the one hour glucose test, I ate a whole bagel with cream cheese, and whole banana and about 12 oz.",
        "17Pramlintide This medication is taken with mealtime insulin and slows the movement of food through the stomach to keep blood sugar from spiking after a meal.",
        "You can also start testing your glucose one hour after meals to see how high you rise, especially on those bad days.",
        "Does it matter if I get my blood sample from somewhere else on my body?A Fingertips on the sides of tips offer a more reliable capillary flow and reading because changes in glucose levels are detected here more rapidly.",
        "Those on an oral medication will want to monitor blood sugar frequently throughout the intensive exercise and may decide to consume a 15 gram carbohydrate snack prior to the exercise.",
        "The hormone insulin, produced by the pancreas, regulates the amount of glucose in your blood by helping liver, muscle, and fat cells absorb the sugar.",
        "You will want to monitor your blood sugar more closely during and after drinking, as it can lead to a low blood sugar.",
        "To stay healthy, keep your blood sugar, blood pressure, and cholesterol under good control.",
        "11Fasting plasma glucose test checks how high your blood sugar is after youve had nothing to eat or drink except small sips or water for at least eight hours.",
        "Increased body fat appears to interfere at the cellular level with the uptake of glucose from the bloodstream into the cell the job of insulin."
      ]
    },
    {
      "tag": "treatment",
      "patterns": [
        "What can you tell me about you can have your insulin output measured with a cpeptide test?",
        "What can you tell me about also, alcohol is the only nutrient that doesnt require insulin to be broken down for energy carbohydrate, protein, and fat do?",
        "What can you tell me about this snack recommendation varies based on age, medicationsinsulin, and many other health factors?",
        "What can you tell me about if your child is not requiring insulin at this time, it may be true that heshe may need it in the future if the pancreas is on a path to no longer being able to produce insulin?",
        "Is it possible to test how much insulin my body still produces?",
        "What can you tell me about it is sold under the brand name insulin inhalation afrezza?",
        "What can you tell me about q will insulin make me gain weight??",
        "What can you tell me about people who inject insulin or use an insulin pump can adjust their insulin prior to exercise to help prevent a low?",
        "What can you tell me about taken before a meal, they work within 15 to 30 minutes and keep working for several hours.insulin therapy typically involves injecting yourself up to several times daily using one of the following methods 18needle and syringe insulin is drawn from a vial through a disposable needle and syringe or the syringe is prefilled and injected into fatty tissue just below the skin.insulin pen using a device that either contains a prefilled cartridge of insulin or draws insulin from the cartridge through a disposable needle, you dial the dosage on the pen and then inject insulin beneath the skin through the needle.insulin pump a computerized device delivers insulin through a thin catheter that is inserted under the skin of the abdomen and kept in place with tape?",
        "What can you tell me about both also involve insulin, a hormone that enables your body to use sugar for fuel?",
        "What can you tell me about insulins job is to process calories?",
        "What can you tell me about the new england journal of medicine?",
        "What can you tell me about this creates a condition called insulin resistance?",
        "What can you tell me about the c peptide test can give an indication of how much insulin your cells are producing?",
        "What can you tell me about will i always need insulin??",
        "What can you tell me about will insulin make me gain weight??",
        "What can you tell me about they may opt to decrease your medication or insulin dose instead of adding a snack to prevent nighttime lows?",
        "What can you tell me about in this case, youll likely need to take insulin injections the rest of your life?",
        "What can you tell me about it sounds as though you had a cpeptide test, and discovered that your insulin reserves are low?",
        "What can you tell me about june 2017.deleted, december 3, 2022.insulin?",
        "What can you tell me about if, however, you started taking insulin when you had an infection, needed surgery, or were hospitalized for a medical reason, your need for insulin may be temporary?",
        "What can you tell me about is it possible to test how much insulin my body still produces??",
        "What can you tell me about over the years, one may need a return to insulin andor other medications?",
        "What can you tell me about journal of clinical medicine?",
        "What can you tell me about bmc medicine?",
        "What can you tell me about january 2015.calculating insulin dose?",
        "What can you tell me about your physician can order a cpeptide test which can give you some idea of how much insulin your pancreas is producing?",
        "What can you tell me about those who are truly type 1 require insulin to live?",
        "What can you tell me about each bout of pancreatitis may be affecting the insulin producing cells a bit more, resulting in a reduced ability of your body to produce sufficient insulin to keep your levels in a better range?",
        "What can you tell me about this was at the same time that rapidacting insulin came to market, which allowed much more flexibility in the diet?",
        "What can you tell me about at the moment, you appear to be type 2, requiring insulin to help lower your numbers?",
        "What can you tell me about q will i need to be on insulin the rest of my life??",
        "What can you tell me about people who take insulin and are physically active should consult their health care provider about how to adjust insulin dosages?",
        "What can you tell me about 24inhaled insulin a rapidacting inhaled insulin that you take at the beginning of each meal by breathing in powder through the mouth using an inhaler?",
        "What can you tell me about a there are tests that can determine levels of natural insulin production?",
        "What can you tell me about the amount of bolus insulin you inject depends on the size of the meal youve just eaten?",
        "What can you tell me about when the stress abates, you may be able to taper or stop taking insulin and get back to your previous medication regimen?",
        "What can you tell me about must i go on insulin??",
        "What can you tell me about at this time, your physician is probably trying to see if you stabilize at 200 or less and perhaps begin to lower on your own as your cells possibly start producing more insulin again?",
        "What can you tell me about if you have a practitioner in your area who understands nutritional therapies, this may help preserve and improve what insulin production you have?",
        "What can you tell me about examples of fastacting or regularacting insulin include insulin aspart novolog, insulin glulisine apidra, and insulin lispro humalog?",
        "What can you tell me about 30your healthcare team can help you decide the right balance, taking into account any medication or insulin youre on?",
        "What can you tell me about weight loss increases insulin sensitivity, allowing cells to more effectively use the insulin the body continues to make?",
        "What can you tell me about treatment involves insulin injections and fluid replacement?",
        "What can you tell me about but a person who lives with type 2 upward of 15 years is unlikely to continue to make sufficient insulin and will need to take it via syringe, pen, or pump?",
        "What can you tell me about what this would mean is that you cannot live without taking insulin?",
        "What can you tell me about if you are truly type 1, you require insulin in order to live, usually via daily injections?",
        "What can you tell me about insulin at this time may help to detoxify your beta cells, giving your pancreas a rest while you move into a more normal range?",
        "What can you tell me about nature medicine?",
        "What can you tell me about this will vary based on the type of insulin andor medication you are using?",
        "What can you tell me about people using an insulin pump can reduce their basal rate a few hours prior to the workout, and those who inject insulin can also make some adjustments to help prevent a low?",
        "What can you tell me about this means they must inject themselves with insulin daily in order to survive, via a syringe and needle, insulin pen, or insulin pump?"
      ],
      "responses": [
        "In this case, youll likely need to take insulin injections the rest of your life.",
        "Both also involve insulin, a hormone that enables your body to use sugar for fuel.",
        "This means they must inject themselves with insulin daily in order to survive, via a syringe and needle, insulin pen, or insulin pump.",
        "The New England Journal of Medicine.",
        "Over the years, one may need a return to insulin andor other medications.",
        "At the moment, you appear to be type 2, requiring insulin to help lower your numbers.",
        "The C peptide test can give an indication of how much insulin your cells are producing.",
        "Is it possible to test how much insulin my body still produces?",
        "The amount of bolus insulin you inject depends on the size of the meal youve just eaten.",
        "Examples of fastacting or regularacting insulin include insulin aspart Novolog, insulin glulisine Apidra, and insulin lispro Humalog.",
        "People who inject insulin or use an insulin pump can adjust their insulin prior to exercise to help prevent a low.",
        "30Your healthcare team can help you decide the right balance, taking into account any medication or insulin youre on.",
        "Journal of Clinical Medicine.",
        "Nature Medicine.",
        "If you are truly type 1, you require insulin in order to live, usually via daily injections.",
        "It is sold under the brand name insulin inhalation Afrezza.",
        "This will vary based on the type of insulin andor medication you are using.",
        "At this time, your physician is probably trying to see if you stabilize at 200 or less and perhaps begin to lower on your own as your cells possibly start producing more insulin again.",
        "This creates a condition called insulin resistance.",
        "This was at the same time that rapidacting insulin came to market, which allowed much more flexibility in the diet.",
        "Those who are truly type 1 require insulin to live.",
        "Each bout of pancreatitis may be affecting the insulin producing cells a bit more, resulting in a reduced ability of your body to produce sufficient insulin to keep your levels in a better range.",
        "Weight loss increases insulin sensitivity, allowing cells to more effectively use the insulin the body continues to make.",
        "People using an insulin pump can reduce their basal rate a few hours prior to the workout, and those who inject insulin can also make some adjustments to help prevent a low.",
        "It sounds as though you had a CPeptide test, and discovered that your insulin reserves are low.",
        "Q Will insulin make me gain weight?",
        "Taken before a meal, they work within 15 to 30 minutes and keep working for several hours.Insulin therapy typically involves injecting yourself up to several times daily using one of the following methods 18Needle and Syringe Insulin is drawn from a vial through a disposable needle and syringe or the syringe is prefilled and injected into fatty tissue just below the skin.Insulin Pen Using a device that either contains a prefilled cartridge of insulin or draws insulin from the cartridge through a disposable needle, you dial the dosage on the pen and then inject insulin beneath the skin through the needle.Insulin Pump A computerized device delivers insulin through a thin catheter that is inserted under the skin of the abdomen and kept in place with tape.",
        "If your child is not requiring insulin at this time, it may be true that heshe may need it in the future if the pancreas is on a path to no longer being able to produce insulin.",
        "Also, alcohol is the only nutrient that doesnt require insulin to be broken down for energy carbohydrate, protein, and fat do.",
        "If you have a practitioner in your area who understands nutritional therapies, this may help preserve and improve what insulin production you have.",
        "If, however, you started taking insulin when you had an infection, needed surgery, or were hospitalized for a medical reason, your need for insulin may be temporary.",
        "You can have your insulin output measured with a CPeptide test.",
        "Insulin at this time may help to detoxify your beta cells, giving your pancreas a rest while you move into a more normal range.",
        "Will Insulin Make Me Gain Weight?",
        "Must I Go On Insulin?",
        "June 2017.Deleted, December 3, 2022.Insulin.",
        "A There are tests that can determine levels of natural insulin production.",
        "Treatment involves insulin injections and fluid replacement.",
        "Q Will I need to be on insulin the rest of my life?",
        "24Inhaled Insulin A rapidacting inhaled insulin that you take at the beginning of each meal by breathing in powder through the mouth using an inhaler.",
        "Insulins job is to process calories.",
        "A It is possible to have your production of insulin cease over time, but usually this is not the case for type 2 diabetes.",
        "People who take insulin and are physically active should consult their health care provider about how to adjust insulin dosages.",
        "January 2015.Calculating Insulin Dose.",
        "Your physician can order a CPeptide test which can give you some idea of how much insulin your pancreas is producing.",
        "They may opt to decrease your medication or insulin dose instead of adding a snack to prevent nighttime lows.",
        "What this would mean is that you cannot live without taking insulin.",
        "When the stress abates, you may be able to taper or stop taking insulin and get back to your previous medication regimen.",
        "BMC Medicine.",
        "This snack recommendation varies based on age, medicationsinsulin, and many other health factors.",
        "But a person who lives with type 2 upward of 15 years is unlikely to continue to make sufficient insulin and will need to take it via syringe, pen, or pump.",
        "Will I Always Need Insulin?"
      ]
    }